{
  "status": "ok",
  "totalResults": 150,
  "articles": [
    {
      "author": "Sarah Fielding",
      "title": "The second-gen Kindle Scribe is $100 off in this Prime Day deal",
      "description": "Amazon Prime Day is here and you can save on all manner of tech, including Amazon's devices, from Kindle tablets to Echo speakers. Take the Amazon Kindle Scribe, which has dropped to $300 from $400. The 25 percent discount brings the second-generation device back down to its all-time low price. This deal is available on the 16GB model in Tungsten (dark grey) and doesn't include Kindle Unlimited. If you want more storage, the 32GB and 64GB versions are also 25 and 24 percent off, respectively. The Kindle Scribe is our pick for best e-reader E Ink tablet. It scored an 86 in our review, thanks to...",
      "url": "https://www.engadget.com/deals/the-second-gen-kindle-scribe-is-100-off-in-this-prime-day-deal-134701405.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F04878620-a2bb-11f0-bb6e-e507d9d5e2df&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=0f3cc6cf5607003b8a213e67e64861864e340ebd",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-07T05:06:28+00:00"
    },
    {
      "author": "Andre Revilla",
      "title": "Get three months of Audible for only $3 with this Prime Day deal",
      "description": "Audiobook fans can get three months of Audible for $3 for a limited time ahead of the fall edition of Amazon Prime Day. Users will be charged $0.99 per month for the first three months, after which it will auto-renew at $14.95 per month. Audible features thousands of titles in its catalog, including podcasts and Audible Originals. Subscribers will also get to choose one audiobook each month to keep in their collection for free, including best-sellers or new releases. Amazon Prime members will receive two credits the first month of their trial. Amazon has been bringing Prime Day back in the fall...",
      "url": "https://www.engadget.com/deals/get-three-months-of-audible-for-only-3-with-this-prime-day-deal-090052863.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2023-11%2Fb0d23590-7a51-11ee-bf3b-6908f61b2e4b&resize=1400%2C770&client=19f2b5e49a271b2bde77&signature=e1c89dc6a5ba03cc479bcd00610833910db2da45",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-07T04:01:25+00:00"
    },
    {
      "author": "Sean Hollister",
      "title": "The Supreme Court didn’t save Google from Epic, and now the clock is ticking",
      "description": "In August, Google had just two weeks to begin cracking open Android, and to stop forcing app developers to use its own payment systems, after Epic Games won its Google lawsuit for the second time. Now, Google has just over two weeks once again — because the US Supreme Court has decided not to save Google ahead of its Supreme Court appeal. Today, the Court denied the company’s request for a partial stay, meaning the permanent injunction is still in effect, meaning Google must do the following things this month or be in violation:Stop Google from forcing app developers to use Google Play...",
      "url": "https://www.theverge.com/news/793610/google-epic-android-supreme-court-stay-denied",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T23:28:10+00:00"
    },
    {
      "author": "Tom Warren",
      "title": "Microsoft is plugging more holes that let you use Windows 11 without an online account",
      "description": "Microsoft is cracking down on bypass methods that let Windows 11 installs use a local account, and avoid an internet requirement during the setup process. In a new Windows 11 test build released today, Microsoft says it’s removing known workarounds for creating local accounts as they can apparently cause issues during the setup process.“We are removing known mechanisms for creating a local account in the Windows Setup experience (OOBE),” says Amanda Langowski, the lead for the Windows Insider Program. “While these mechanisms were often used to bypass Microsoft account setup, they also...",
      "url": "https://www.theverge.com/news/793579/microsoft-windows-11-local-account-bypass-workaround-changes",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T22:37:42+00:00"
    },
    {
      "author": "Rebecca Szkutak",
      "title": "Deloitte goes all in on AI — despite having to issue a hefty refund for use of AI",
      "description": "Deloitte is rolling out Claude to its nearly 500,000 employees after issuing a refund for a report that contained AI hallucinations.",
      "url": "https://techcrunch.com/2025/10/06/deloitte-goes-all-in-on-ai-despite-having-to-issue-a-hefty-refund-for-use-of-ai/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T22:29:47+00:00"
    },
    {
      "author": "",
      "title": "Mina the Hollower, from the makers of Shovel Knight, has been delayed",
      "description": "There&#39;s good and bad news coming from Yacht Club Games, the studio behind Shovel Knight. The bad news is that the company&#39;s upcoming game, Mina the Hollower, has been delayed from its planned October 31 release date. But the good news is that it doesn&#39;t seem like this will be a lengthy wait.&nbsp;There&#39;s no new launch date given in the post on the developer&#39;s website, but Yacht Club says that it won&#39;t be much longer before the game is ready. \"The entire crew has been working tirelessly day and night to finish development for release on Oct 31st, but we’re just not...",
      "url": "https://www.engadget.com/mina-the-hollower-from-the-makers-of-shovel-knight-has-been-delayed-222817866.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-06%2F57b02290-4324-11f0-bea3-a282a2ed0228&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=4c88b8f52865a0f5a69c99da7adaf9dc927edbb6",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T22:28:17+00:00"
    },
    {
      "author": "Emma Roth",
      "title": "ChatGPT apps are live: Here are the first ones you can try",
      "description": "OpenAI has launched new integrations that plug controls for other apps directly inside ChatGPT, letting you call them up to make a playlist in Spotify or search for local real estate listings on Zillow without leaving the chatbot.&nbsp;&nbsp;It’s a bit like the “mini” apps that messaging platforms like Telegram and Discord have embedded inside their platforms, or the extensions that bring controls for music players to your iPhone’s Dynamic Island, but with an AI twist. With the integrations, you can continue talking to ChatGPT while providing instructions about how you’d like it to...",
      "url": "https://www.theverge.com/news/793081/chagpt-apps-sdk-spotify-zillow-openai",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T21:51:37+00:00"
    },
    {
      "author": "Lauren Feiner",
      "title": "The judge tasked with deciding Google’s fate would rather not",
      "description": "As the second phase of the Google ad tech trial was winding down, Judge Leonie Brinkema was still hoping that Google and the Justice Department would take the decision out of her hands. \"My favorite phrase is 'Let's settle this case,'\" she told attorneys for both sides shortly before adjourning the courtroom after more than 10 days of trial in the remedies case. Brinkema ruled in April that Google had illegally monopolized the market for publisher ad servers and ad exchanges, and illegally tied its products together to make it difficult for customers to move to competitors' options. As it turns...",
      "url": "https://www.theverge.com/policy/793455/google-doj-ad-tech-judge-brinkema-break-up",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T21:41:07+00:00"
    },
    {
      "author": "",
      "title": "Bungie will conduct technical testing on Marathon later this month",
      "description": "After several silent months, Bungie has opened applications for players interested in participating in a closed technical test of Marathon. It&#39;s an invitation-only limited-time test, lasting just October 22-28. Those who are chosen to participate can only do so under a non-disclosure agreement, so don&#39;t expect to hear any juicy details or insights about the game&#39;s status later this month once the event wraps.&nbsp;While it&#39;s not a new public look at Marathon, news of a fresh round of testing marks a small step forward for this team extraction shooter. The game was originally...",
      "url": "https://www.engadget.com/bungie-will-conduct-technical-testing-on-marathon-later-this-month-213422857.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fmedia-mbst-pub-ue1.s3.amazonaws.com%2Fcreatr-uploaded-images%2F2025-06%2F0f0d4a40-4bad-11f0-9bef-b72902242301&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=07a2bb5940d365d541a2d9a3386aa374819c870b",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T21:34:22+00:00"
    },
    {
      "author": "Jay Peters",
      "title": "What’s going on with this Instagram promotion?",
      "description": "The Ring is a fantastic horror film that still gives me the chills. I can easily recall the movie’s iconic poster, which features a white ring on a black background and a creepy title font — I didn’t see the movie until years after it first released, but even the thought of it frightened me. So I’m very confused as to why Instagram picked a similar vibe for the debut of Instagram Rings, a new “award” that’s intended to celebrate creators and creativity.Instagram has assembled a panel of judges, which includes Spike Lee, Marc Jacobs, Marques Brownlee, and, uh, Instagram head Adam...",
      "url": "https://www.theverge.com/news/793410/meta-instagram-rings-the-ring-creators-movie",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T21:03:34+00:00"
    },
    {
      "author": "Sean O'Kane",
      "title": "Lucid Motors sets record as Gravity sales pick up and tax credit expires",
      "description": "The company has seen EV deliveries increase for seven straight quarters, even though it's still way off the ambitious goals it promoted when it went public in 2021.",
      "url": "https://techcrunch.com/2025/10/06/lucid-motors-sets-record-as-gravity-sales-pick-up-and-tax-credit-expires/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T21:00:33+00:00"
    },
    {
      "author": "Amanda Silberling",
      "title": "Taylor Swift fans accuse singer of using AI in her Google scavenger hunt videos",
      "description": "Swifties love a puzzle, but some were rubbed the wrong way by a promotional scavenger hunt which appeared to use AI-generated videos.",
      "url": "https://techcrunch.com/2025/10/06/taylor-swift-fans-accuse-singer-of-using-ai-in-her-google-scavenger-hunt-videos/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T20:50:16+00:00"
    },
    {
      "author": "Elissa Welle",
      "title": "Google&#8217;s AI bounty program pays bug hunters up to $30K",
      "description": "On Monday, Google launched a new reward program dedicated specifically to finding bugs in AI products. Google’s list of qualifying bugs includes examples of the kind of rogue actions it’s looking for, like indirectly injecting an AI prompt that causes Google Home to unlock a door, or a data exfiltration prompt injection that summarizes all of someone’s email and sends the summary to the attacker’s own account.The new program clarifies what constitutes an AI bug, breaking them down as issues that use a large language model or a generative AI system to cause harm or take advantage of a...",
      "url": "https://www.theverge.com/news/793362/google-ai-security-vulnerability-rewards",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T20:24:53+00:00"
    },
    {
      "author": "",
      "title": "Spotify, Canva and other apps can now connect to ChatGPT",
      "description": "You’ll soon be able to interact with some of your favorite apps, including Spotify and Canva, right inside of ChatGPT. OpenAI announced the integration, which is enabled by the company’s new Apps SDK, during its DevDay presentation. As of today, ChatGPT can connect to a handful of apps, with more to come over time and OpenAI working on submission guidelines that will allow developers to monetize their work. As a ChatGPT user, you can any access available third-party app by referencing it in your conversations with the chatbot. In the case of Spotify, for example, you can write “Spotify...",
      "url": "https://www.engadget.com/spotify-canva-and-other-apps-can-now-connect-to-chatgpt-194830116.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fd29szjachogqwa.cloudfront.net%2Fvideos%2Fuser-uploaded%2Fopen-ai.jpg&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=8732fbc429c0873acd5e6c7089bcd147b8768f17",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T19:48:30+00:00"
    },
    {
      "author": null,
      "title": "Is It Worth Upgrading to the iPhone 17? Specs, Price, and Feature Comparison - CNET",
      "description": "Is It Worth Upgrading to the iPhone 17? Specs, Price, and Feature Comparison&nbsp;&nbsp;CNETWant to upgrade to the iPhone 17 Pro Max? Read this review before you do&nbsp;&nbsp;The Indian ExpressApple iPhone 17 vs iPhone Air vs 17 Pro vs iPhone 17 Pro Max: Which One Should You Buy In 2025&nbsp;&nbsp;Times NowApple iPhone 17 Pro review: Come for the camera, stay for the battery&nbsp;&nbsp;Ars TechnicaiPhone 17 Pro Max vs. iPhone 16 Pro Max&nbsp;&nbsp;GSMArena.com",
      "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNN01pdlhMVnd2T2RWSnRXYjkyNmUwY2VNRHVucTdvSkMxMnlMVTJLSW15dHlxNDBtX0MwR3BtNUhOOGNpS0F0T09aMVp3UHRINHRDQ3ctSXRYQnlXOWJBNnZRUmFidVVaMmF1UHdsZlAzeWtEYUViZ25kQlFUS2t2aTg1d2RIZmdyUlJoUnRSSDEtYlRjbVNUb0txb3dLMC0tR3lIQkkyeENSSXc?oc=5",
      "source": "Google News Technology IN",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "in",
      "published_at": "2025-10-06T19:37:14+00:00"
    },
    {
      "author": "Tim De Chant",
      "title": "Microsoft buys another 100 MW of solar, this time in Japan",
      "description": "The new deal covers output from four different solar projects. Microsoft has said it will spend $2.9 billion to expand its infrastructure in Japan.",
      "url": "https://techcrunch.com/2025/10/06/microsoft-buys-another-100-mw-of-solar-this-time-in-japan/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T19:19:13+00:00"
    },
    {
      "author": "Rebecca Bellan",
      "title": "OpenAI ramps up developer push with more powerful models in its API ",
      "description": "The updates were part of a series of announcements geared towards wooing developers to OpenAI’s ecosystem, including the launch of an agent-building tool and the ability to build apps in ChatGPT. ",
      "url": "https://techcrunch.com/2025/10/06/openai-ramps-up-developer-push-with-more-powerful-models-in-its-api/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T19:10:27+00:00"
    },
    {
      "author": "Sarah Perez",
      "title": "MrBeast says AI could threaten creators’ livelihoods, calling it ‘scary times’ for the industry",
      "description": "As Sora tops the App Store, MrBeast says AI could threaten creators' ability to make money.",
      "url": "https://techcrunch.com/2025/10/06/mrbeast-says-ai-could-threaten-creators-livelihoods-calling-it-scary-times-for-the-industry/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T19:05:20+00:00"
    },
    {
      "author": "Will Knight",
      "title": "OpenAI's Blockbuster AMD Deal Is a Bet on Near-Limitless Demand for AI",
      "description": "OpenAI’s latest move in the race to build massive data centers in the US shows it believes demand for AI will keep surging—even as skeptics warn of a bubble.",
      "url": "https://www.wired.com/story/openai-amd-deal-data-center-chips/",
      "source": "Wired",
      "image": "https://media.wired.com/photos/68e3f1d32a7fb4206cabf17c/master/pass/OpenAI-Blockbuster-AMD-Deal-Is-Another-Bet-on-Near-Limitless-Demand-AI-Business-2213420891.jpg",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T18:31:40+00:00"
    },
    {
      "author": "Aisha Malik",
      "title": "Instagram introduces new “Ring” award for top creators",
      "description": "The move comes as Meta has been scaling back its creator payout programs over the past few years.",
      "url": "https://techcrunch.com/2025/10/06/instagram-introduces-new-ring-award-for-top-creators/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T18:11:10+00:00"
    },
    {
      "author": "Rebecca Bellan",
      "title": "OpenAI launches AgentKit to help developers build and ship AI agents ",
      "description": "“AgentKit is a complete set of building blocks available in the open AI platform designed to help you take agents from prototype to production, it is everything you need to build, deploy and optimize agent workflows with way less friction,” Sam Altman said Monday at OpenAI's Dev Day.  ",
      "url": "https://techcrunch.com/2025/10/06/openai-launches-agentkit-to-help-developers-build-and-ship-ai-agents/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T18:00:31+00:00"
    },
    {
      "author": "Maxwell Zeff",
      "title": "OpenAI launches apps inside of ChatGPT",
      "description": "OpenAI is launching a new way for developers to build applications that appear directly inside of ChatGPT's conversations.",
      "url": "https://techcrunch.com/2025/10/06/openai-launches-apps-inside-of-chatgpt/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:57:59+00:00"
    },
    {
      "author": "Verge Staff",
      "title": "US v. Google redux: all the news from the ad tech trial",
      "description": "On April 17th, 2025, Judge Brinkema ruled that Google did act illegally to acquire and maintain monopoly power in online advertising. Now, DOJ and Google lawyers are returning to the courtroom to argue over whether this should lead to a Google breakup by forcing the company to sell its AdX exchange.In the initial trial, the DOJ argued that Google unfairly locked up the market for ad tech tools that publishers and advertisers rely on to monetize their websites and market their goods. Google responded that it created efficient products that work well for customers and said it faced plenty of...",
      "url": "https://www.theverge.com/24237832/google-monopoly-trial-ad-tech-antitrust-us-search",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:55:43+00:00"
    },
    {
      "author": "Jay Peters",
      "title": "OpenAI will let developers build apps that work inside ChatGPT",
      "description": "OpenAI is introducing a way to work with apps right inside ChatGPT. The idea is that, from within a conversation with the chatbot, you can essentially tag in apps to help you complete a task while ChatGPT offers context and advice.&nbsp;The company showed off a few different ways this can work. In a live demo, an OpenAI employee launched ChatGPT and then asked Canva to create a poster of a name for a dog-walking business; after a bit of waiting, Canva came back with a few different examples, and the presenter followed up by asking for a generated pitch deck based on the poster. The employee...",
      "url": "https://www.theverge.com/news/793039/openai-chatgpt-apps-developers-sdk-canva-zillow-devday-2025",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:48:48+00:00"
    },
    {
      "author": "Rebecca Bellan",
      "title": "Sam Altman says ChatGPT has hit 800M weekly active users ",
      "description": "OpenAI CEO Sam Altman said Monday at Dev Day that ChatGPT has reached 800 million weekly active users, marking an increase of adoption among consumers, developers, enterprises, and governments.  ",
      "url": "https://techcrunch.com/2025/10/06/sam-altman-says-chatgpt-has-hit-800m-weekly-active-users/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:30:27+00:00"
    },
    {
      "author": "Andrew Liszewski",
      "title": "Lexar’s new SSD sticks to your iPhone and can survive nearly a 10-foot drop",
      "description": "The ES5 SSD is MagSafe compatible. | Image: Lexar First announced in July, Lexar’s ES5 Magnetic Portable SSD is now available in a 1TB capacity for $119.99 or 2TB for $199.99. A 4TB version is also planned, but availability isn’t expected until Q1 of 2026.The ES5 is compatible with any USB-equipped device and delivers read and write speeds of up to 2000MB/s. It’s quite a bit larger than Lexar’s Professional Go Portable SSD that debuted over a year ago, but also twice as fast. It’s also compatible with mobile devices like tablets and smartphones, but Lexar is targeting Apple users...",
      "url": "https://www.theverge.com/news/793032/lexar-es5-magnetic-magsafe-portable-ssd-apple-prores-4k",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:21:49+00:00"
    },
    {
      "author": "Sheena Vasani",
      "title": "The best Apple deals to shop ahead of Amazon’s fall Prime Day event",
      "description": "The entry-level AirPods 4 are already on sale for $89.99, essentially matching their all-time low. If the past is any indication, Prime Big Deal Days — Amazon’s upcoming fall Prime Day event — should deliver a wave of deals on Apple devices, letting you save on everything from AirPods and AirTags to the latest iPad. However, if you can’t wait until the sale kicks off tomorrow, October 7th, to land a bargain, you don’t have to. A few Apple products are already receiving sizable discounts at Amazon and other retailers, giving you the chance to save ahead of the two-day shopping event....",
      "url": "https://www.theverge.com/tech/784180/amazon-october-prime-day-sale-best-early-apple-deals-2025",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:21:12+00:00"
    },
    {
      "author": "Kyle Wiggers, Rebecca Bellan",
      "title": "Meta Llama: Everything you need to know about the open generative AI model",
      "description": "Here's everything you need to know about Meta’s Llama, from its capabilities and editions to where you can use it. We'll keep this post updated as Meta releases upgrades and introduces new dev tools to support the model's use.",
      "url": "https://techcrunch.com/2025/10/06/meta-llama-everything-you-need-to-know-about-the-open-generative-ai-model/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:11:50+00:00"
    },
    {
      "author": "Richard Lawler",
      "title": "All of the updates from OpenAI Dev Day 2025",
      "description": "OpenAI, founded in 2015 to develop artificial general intelligence (AGI) — AI systems with human-level intelligence — has transformed dramatically since launching ChatGPT, which was once considered &#8220;the fastest-growing consumer application in history.&#8221; Since then, controversies have swirled over everything: whether Sam Altman should be CEO, chatbot safety, the environmental impact of AI datacenters, an ongoing feud with Elon Musk, and even how much glaze is too much or too little for new products like GPT-5.Now, at its Dev Day 2025 event, we’ll be looking for updates on its...",
      "url": "https://www.theverge.com/news/640086/openai-chat-gpt-news-updates",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:11:44+00:00"
    },
    {
      "author": "Zack Whittaker",
      "title": "Clop hackers caught exploiting Oracle zero-day bug to steal executives’ personal data",
      "description": "Oracle fixes another security flaw that Clop hackers were using to steal sensitive personal information about executives as part of a mass-extortion campaign.",
      "url": "https://techcrunch.com/2025/10/06/clop-hackers-caught-exploiting-oracle-zero-day-bug-to-steal-executives-personal-data/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:07:40+00:00"
    },
    {
      "author": "Lawrence Bonk",
      "title": "Instagram will start handing out awards to select creators",
      "description": "Instagram is launching its own awards program, according to The Hollywood Reporter. This is sort of like the Oscars, but for short-form social media content. There isn&#39;t an awards ceremony, a comedian host or anything like that. Instead, the 25 winners will get physical rings.These rings will be designed by fashionista Grace Wales Bonner. Maybe they&#39;ll be worth a few bucks, as the recognition doesn&#39;t include a financial payout of any kind. However, winners will get a digital replica of a ring to put on their Instagram profile and stories.InstagramHonorees also receive the ability to...",
      "url": "https://www.engadget.com/social-media/instagram-will-start-handing-out-awards-to-select-creators-170531135.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F91770bf0-a2d4-11f0-a789-924f33acd031&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=649c6daf115273931bb0c5725fafd2af38533918",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:05:31+00:00"
    },
    {
      "author": null,
      "title": "UpCodes (YC S17) is hiring remote engineers across the Americas",
      "description": "Comments",
      "url": "https://up.codes/careers?utm_source=HN",
      "source": "Hacker News",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T17:01:31+00:00"
    },
    {
      "author": "Will Shanklin",
      "title": "Apple's AirPods 4 drop to $90 for Prime Day",
      "description": "Those on a tight budget and those who prefer open-ear AirPods will want to check out the latest discount on the AirPods 4. Apple's entry-level wireless earbuds are down to $90 for October Prime Day, or 30 percent off their normal rate. That's also the lowest we've seen them. When Apple updated its standard AirPods in 2024, it released two models: one with active noise cancellation (ANC) and one without. We consider the non-ANC models to be the best budget AirPods you can get, so they're an even better buy at this sale price. The ANC versions are also discounted at the moment, so you can pick...",
      "url": "https://www.engadget.com/deals/apples-airpods-4-drop-to-90-for-prime-day-130033169.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F2816d950-a096-11f0-bef6-b834e5600df0&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=af92f02f98f507fe284f3f5caabefd2c2207fa14",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T16:48:32+00:00"
    },
    {
      "author": "Zoë Schiffer, Manisha Krishnan",
      "title": "WIRED Roundup: The New Fake World of OpenAI’s Social Video App",
      "description": "On this episode of Uncanny Valley, we break down some of the week's best stories, covering everything from Peter Thiel's obsession with the Antichrist to the launch of OpenAI’s new Sora 2 video app.",
      "url": "https://www.wired.com/story/uncanny-valley-podcast-wired-roundup-the-new-fake-world-of-openais-social-video-app/",
      "source": "Wired",
      "image": "https://media.wired.com/photos/68dff9a45b31fc2ba1728e51/master/pass/Uncanny-Valley-Roundup-Business-2236544160.jpg",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T16:43:21+00:00"
    },
    {
      "author": "Justine Calma",
      "title": "Tech companies poured money into carbon removal projects now in Trump’s crosshairs",
      "description": "People gather for the groundbreaking for Oxys Direct Air Capture facility called Stratos in West Texas on Friday, April 28th, 2023. | Photo: Getty Images The tech industry has championed the development of new technologies that filter carbon dioxide out of the air as a way to try to undo the damage caused by planet-heating emissions. Over the past several years, they've made a slew of splashy announcements to fund these kinds of projects, called direct air capture (DAC). That dovetailed with the Joe Biden administration's attempt to fight climate change by funneling federal dollars into...",
      "url": "https://www.theverge.com/report/792812/trump-funding-cut-climate-carbon-removal-hub",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T16:34:13+00:00"
    },
    {
      "author": "David McCabe, Megan Mineiro, Emmett Lindner and Cecilia Kang",
      "title": "U.S. v. Google: What Each Side Argued for Fixing Google’s Ad Tech Monopoly",
      "description": "The Justice Department and Google wrapped up a two-week hearing that could have a major effect on online advertising.",
      "url": "https://www.nytimes.com/2025/10/06/technology/google-ad-tech-arguments.html",
      "source": "The New York Times",
      "image": "https://static01.nyt.com/images/2025/09/30/multimedia/OakArticle-68dc1468-1-hmzl/OakArticle-68dc1468-1-hmzl-mediumSquareAt3X.jpg",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T16:17:44+00:00"
    },
    {
      "author": "Tim De Chant",
      "title": "Okosix will show its biodegradable plastic at TechCrunch Disrupt 2025",
      "description": "Healthcare has a plastic problem, but Okosix thinks its bio-derived, biodegradable material can replace single-use plastics throughout the industry.",
      "url": "https://techcrunch.com/2025/10/06/okosix-will-show-its-biodegradable-plastic-at-techcrunch-disrupt-2025/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T16:07:21+00:00"
    },
    {
      "author": "Amy Skorheim",
      "title": "Don’t buy an Echo Show (you can have mine)",
      "description": "Last week, Amazon announced two new Echo Show devices during its fall hardware event. From the stage, Amazon execs repeatedly used the phrase “blend into the background.” Amazon hardware chief Panos Panay told a personal story, recounting how Alexa+ was able to “shift the balance” at his dinner table, supplying his family with facts to settle their mealtime debates, no phones required. He praised the fact that Alexa+ can help \"without distracting you” or “taking you away from what’s most important.” Laudable sentiment, for sure. It’s jarring to be ripped away from a moment by...",
      "url": "https://www.engadget.com/home/smart-home/dont-buy-an-echo-show-you-can-have-mine-155730401.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F5622acb0-a2c7-11f0-968f-7e5d3ea0c0d0&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=5132b8d6be5458b3c612ab1a9ccf28c8d1a74b9e",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T15:57:30+00:00"
    },
    {
      "author": "Maxwell Zeff",
      "title": "What to expect at OpenAI’s DevDay 2025, and how to watch it",
      "description": "OpenAI's third developer conference is around the corner, and it's shaping up to be the company's biggest yet.",
      "url": "https://techcrunch.com/2025/10/06/what-to-expect-at-openais-devday-2025-and-how-to-watch-it/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T15:53:22+00:00"
    },
    {
      "author": "Ivan Mehta",
      "title": "A 19-year-old nabs backing from Google execs for his AI memory startup, Supermemory",
      "description": "19-year-old Dhravya Shah, who is originally from Mumbai, has build a memory layer for AI applications with Google's AI chief's backing.",
      "url": "https://techcrunch.com/2025/10/06/a-19-year-old-nabs-backing-from-google-execs-for-his-ai-memory-startup-supermemory/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T15:45:13+00:00"
    },
    {
      "author": "Sarah Perez",
      "title": "Adobe predicts AI-assisted online shopping to grow 520% during the 2025 U.S. holiday season",
      "description": "AI-assisted online shopping is still booming, new U.S. holiday e-commerce forecast shows.",
      "url": "https://techcrunch.com/2025/10/06/adobe-predicts-ai-assisted-online-shopping-to-grow-520-during-the-2025-u-s-holiday-season/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T15:39:44+00:00"
    },
    {
      "author": "Emma Roth",
      "title": "Verizon appoints a new CEO for the &#8216;next phase&#8217; after its 5G rollout",
      "description": "PayPal appointed Dan Schulman as CEO in 2014, and he stepped down in 2023. | Photo by Nathan Laine/Bloomberg via Getty Images Verizon has picked former PayPal head Dan Schulman to serve as its new CEO as the company enters its “next phase” of growth, Verizon board chair Mark Bertolini says in the Monday announcement. Starting today, Schulman will replace outgoing CEO Hans Vestberg, who will now serve as a special advisor through October 4th, 2026.Vestberg became the CEO of Verizon in 2018, where he oversaw the carrier’s 5G launch and its expansion. Last year, Vestberg admitted that people...",
      "url": "https://www.theverge.com/news/792875/verizon-dan-schulman-ceo-hans-vestberg-replacement",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T15:35:40+00:00"
    },
    {
      "author": "Jeff Dunn",
      "title": "The best October Prime Day deals on Apple devices: Save on AirPods, iPads, AirTags and more",
      "description": "If you’ve been waiting for a discount before grabbing a new iPad, MacBook or Apple Watch, Amazon’s October Prime Day sale might be worth checking out. Prime Big Deal Days, as it’s officially called, doesn’t technically begin until tomorrow, but we’re keeping an eye out for the best Apple deals that are going on in the lead-up to the event. So far, the selection is pretty strong, with the AirPods 4, iPad Air, MacBook Air and several other devices at or near the lowest prices we've seen. You can find our full roundup below, and we’ll be updating this post over the course of the two-...",
      "url": "https://www.engadget.com/deals/the-best-october-prime-day-deals-on-apple-devices-save-on-airpods-ipads-airtags-and-more-125644485.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F6a585780-9f06-11f0-a7ff-f5c2a2b114ba&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=99dcf314b393c40f96bee81b45bd51196115c805",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T14:51:25+00:00"
    },
    {
      "author": "Aisha Malik",
      "title": "Instagram updates its Map feature to make it easier to tell if you’re sharing your location",
      "description": "Instagram is adding a more prominent indicator at the top of the Map to remind users whether or not they’re sharing their location.",
      "url": "https://techcrunch.com/2025/10/06/instagram-updates-its-map-feature-to-make-it-easier-to-tell-if-youre-sharing-your-location/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T14:36:54+00:00"
    },
    {
      "author": "Valentina Palladino",
      "title": "Best Amazon Prime Day laptop deals: Discounts on machines from Apple, Lenovo, Dell, HP and more",
      "description": "So you need a new laptop — now’s the time of year to look out for one on sale. October Prime Day, as has been in years past, offers a ton of laptop deals to consider. All kinds of devices are on sale this year for Big Deal Days, from refreshed MacBooks to high-end gaming machines to already affordable notebooks. But sussing out a good deal from a just-ok deal (or even worse, a bad deal all together), can be a challenge. Laptop prices for machines from Lenovo, Dell, Acer and others on Amazon are all over the place even when it’s not Prime Day depending on the configuration of the notebook...",
      "url": "https://www.engadget.com/deals/best-amazon-prime-day-laptop-deals-discounts-on-machines-from-apple-lenovo-dell-hp-and-more-130507738.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2Fa3219cd0-9d57-11f0-9f76-663ba8ad5020&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=e61a9b28be7fdfa3a82a0613491fec33ae39d5f0",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T14:20:38+00:00"
    },
    {
      "author": "Emma Roth",
      "title": "CBS News was just taken over by a Substack",
      "description": "Bari Weiss started The Free Press (formerly Common Sense) on Substack in 2021. Paramount is acquiring The Free Press, an independent media publication started on Substack. As part of the deal, Paramount is installing The Free Press’s founder, Bari Weiss, as the editor-in-chief of CBS News, according to an announcement on Monday.Before starting The Free Press, Weiss worked as an op-ed and book review editor at The Wall Street Journal from 2013 to 2017 and later became an op-ed editor and writer at The New York Times to expand the publication’s stable of conservative columnists during Trump...",
      "url": "https://www.theverge.com/news/792752/cbs-news-paramount-the-free-press-acquisition-bari-weiss",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T14:09:27+00:00"
    },
    {
      "author": null,
      "title": "Show HN: Kent Dybvig's Scheme Machine in 400 Lines of C (Heap-Memory Model)",
      "description": "Comments",
      "url": "https://gist.github.com/swatson555/8cc36d8d022d7e5cc44a5edb2c4f7d0b",
      "source": "Hacker News",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T14:06:29+00:00"
    },
    {
      "author": "Joanna Stern",
      "title": "Rivian CEO: &#8216;We&#8217;re really convicted&#8217; about skipping CarPlay",
      "description": "Hello, and welcome to Decoder! My guest today is Rivian CEO RJ Scaringe, and I’m very excited to be talking to him on my show today.And when I say my show… I mean Nilay Patel’s show. This is my final episode filling in for Nilay while he’s out on parental leave. I’m Joanna Stern, the senior personal tech columnist at The Wall Street Journal, author of the upcoming book I AM NOT A ROBOT (out in 2026), and — fun fact — a cofounder of The Verge.Listen to Decoder, a show hosted by The Verge’s Nilay Patel about big ideas — and other problems.&nbsp;Subscribe&nbsp;here!Decoder is off...",
      "url": "https://www.theverge.com/podcast/790685/rivian-ceo-rj-scaringe-r2-tariffs-china-ev-apple-carplay",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T14:00:00+00:00"
    },
    {
      "author": "Cameron Faulkner",
      "title": "Logitech’s new MX Master 4 wireless mouse is already $30 off",
      "description": "The MX Master 4 is Logitech’s latest wireless mouse in the MX series, featuring a new haptics-equipped thumb grip that can provide tactile feedback while multitasking. It just launched last week at $119.99, but Best Buy has it available in multiple color schemes for $89.99. You don’t need me to tell you that this is a fantastic deal, given that it’s an improvement on the already-great (and, as of now, slightly pricier) MX Master 3S that came out in 2022.Logitech MX Master 4 wireless mouseWhere to Buy: $119.99 $89.99 at Best BuyThe haptics implemented in the MX Master 4 may not unlock a...",
      "url": "https://www.theverge.com/tech/792702/logitech-mx-master-4-deal-sale",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T13:43:17+00:00"
    },
    {
      "author": "Rebecca Bellan",
      "title": "AMD to supply 6GW of compute capacity to OpenAI in chip deal worth tens of billions",
      "description": "AMD has signed a multi-year chip supply deal with OpenAI that could generate tens of billions in revenue for the chipmaker, helping accelerate its momentum in the AI industry. ",
      "url": "https://techcrunch.com/2025/10/06/amd-to-supply-6gw-of-compute-capacity-to-openai-in-chip-deal-worth-tens-of-billions/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T13:33:26+00:00"
    },
    {
      "author": "Robert Hart",
      "title": "Fictional characters are (officially) coming to Sora as OpenAI manages copyright chaos",
      "description": "Collabs with fictional characters are on the horizon for Sora. Officially, that is, as OpenAI moves to restrict the flow of unauthorized horrors like meth-cooking and Nazi SpongeBobs and criminal Pokémon that have plagued the platform from day one.Bill Peebles, leader of the Sora team at OpenAI, said fictional character appearances in videos, known as cameos, are “on the roadmap,” with details hopefully dropping “soon,” teasing a sanctioned way to use copyrighted characters on the platform.View LinkIt comes as CEO Sam Altman pivoted over the weekend from the company’s opt-out...",
      "url": "https://www.theverge.com/news/792661/sora-fictional-copyright-characters",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T12:40:45+00:00"
    },
    {
      "author": "Aria Alamalhodaei",
      "title": "Firefly leans into its defense ambitions with $855M SciTec acquisition",
      "description": "Firefly Aerospace has agreed to buy defense analytics firm SciTec for about $855 million in cash and stock as the company tries to push deeper into the national security market.",
      "url": "https://techcrunch.com/2025/10/06/firefly-leans-into-its-defense-ambitions-with-855m-scitec-acquisition/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T10:48:46+00:00"
    },
    {
      "author": "Pete Cottell",
      "title": "The 7 Best Milk Frothers for Your Home Espresso Setup (2025)",
      "description": "Up your home espresso-making game with these WIRED-tested foam makers—including our top pick, Subminimal's NanoFoamer Pro.",
      "url": "https://www.wired.com/gallery/best-milk-frothers/",
      "source": "Wired",
      "image": "https://media.wired.com/photos/68e324c965d1d6d2ece830f5/master/pass/A%20Former%20Barista%20Tests%20the%20Most%20Popular%20Milk%20Frothers.png",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T10:39:00+00:00"
    },
    {
      "author": "Robert Hart",
      "title": "Sora provides better control over videos featuring your AI self",
      "description": "A frame from a Sora 2-generated video. Sora now lets you rein in your AI doubles, giving you more say on how and where deepfake versions of you make an appearance on the app. The update lands as OpenAI hurries to show it actually cares about its users’ concerns as an all-too-predictable tsunami of AI slop threatens to take over the internet.&nbsp;The new controls are part of a broader batch of weekend updates meant to stabilize Sora and manage the chaos brewing in its feed. Sora is essentially “a TikTok for deepfakes,” a place to make 10-second videos of pretty much anything, including AI...",
      "url": "https://www.theverge.com/news/792638/sora-provides-better-control-over-videos-featuring-your-ai-self",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T10:23:34+00:00"
    },
    {
      "author": "Jess Weatherbed",
      "title": "Sam Altman and Jony Ive&#8217;s secret device won&#8217;t be &#8216;your weird AI girlfriend&#8217;",
      "description": "The goal is to develop a similar AI-assistant experience to Siri, “but better.” OpenAI and designer Jony Ive are trying to solve a number of technical challenges before releasing their mysterious AI gadget, according to a Financial Times report. Two of the challenges include figuring out the palm-sized device’s “personality” and how often it should talk. “The concept is that you should have a friend who’s a computer who isn’t your weird AI girlfriend,” according to one source briefed on the plans.&nbsp;The report describes the device as lacking a screen and being “roughly...",
      "url": "https://www.theverge.com/news/792635/openai-jony-ive-ai-device-voice-personality-issues",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T09:28:04+00:00"
    },
    {
      "author": "Steve Dent",
      "title": "The best vlogging cameras for 2025",
      "description": "Vlogging used to be a niche camera category, but it’s now at least equal to (if not dominating) the photo scene. All the major camera companies now have multiple creator models with new ones arriving nearly every month, including Nikon’s awesome new ZR hybrid creator camera built in collaboration with cinema company RED.Other recent creator models include Sony's powerful full-frame ZV-E1, the Insta360 X5 and Fujifilm’s X-M5. Some cameras in this guide, like the new Panasonic S1 II and Panasonic’s GH7, are hybrid mirrorless cameras with vlogging powers as part of a greater toolkit.All...",
      "url": "https://www.engadget.com/cameras/best-vlogging-camera-151603452.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-03%2F4362fc00-0656-11f0-8f3b-09f170f24aa2&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=676ba23e6cf65c579cbbf53cf831ebb26528b987",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T07:01:27+00:00"
    },
    {
      "author": "Eshe Nelson",
      "title": "From Jaguars to Grocery Shelves: Cyberattacks Disrupt British Daily Life",
      "description": "Jaguar Land Rover is the third big British brand to have its operations severely affected by a breach this year.",
      "url": "https://www.nytimes.com/2025/10/06/business/jaguar-range-rover-cyberattacks-britain.html",
      "source": "The New York Times",
      "image": "https://static01.nyt.com/images/2025/10/06/multimedia/06biz-uk-cyberattacks1-kpvt/06biz-uk-cyberattacks1-kpvt-mediumSquareAt3X.jpg",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T04:01:12+00:00"
    },
    {
      "author": null,
      "title": "A Smarter Way to Disagree - Harvard Business Review",
      "description": "A Smarter Way to Disagree&nbsp;&nbsp;Harvard Business Review",
      "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE9iRnN4WWVXQ0JiYmRoRC15cnRBZ2RmbTZuNjhqX3BUT2hjZlBheE4yZWxRN1lmajR5REw1SXBYRFYweW5KNWJPVjJNdHM5ZkVpZmVJZlRCQTVlYkExUmc?oc=5",
      "source": "Google News Technology US",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-06T01:20:15+00:00"
    },
    {
      "author": null,
      "title": "Bose's new QuietComfort Ultra earbuds just quietly got their first price drop - Mashable",
      "description": "Bose's new QuietComfort Ultra earbuds just quietly got their first price drop&nbsp;&nbsp;MashableBose's new QuietComfort Ultra headphones: First impression review&nbsp;&nbsp;MashableBose QuietComfort Ultra Gen 2: A Game-Changer in Audio&nbsp;&nbsp;MSNBose QuietComfort Ultra Headphones (2nd Gen) v Apple AirPods Max: Which have the best ANC?&nbsp;&nbsp;SoundGuysNew Desert Gold Bose QuietComfort Ultra buds and headphones surface on Amazon [Launch deal]&nbsp;&nbsp;9to5Toys",
      "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPYVpNbE4yVWd1bHlYOWpJT2pMWDB0TnpZbUdFREZ2OFZEd2RKZ2RuZFVSNENUQk0wVjY2bGpsTmo2eFJDZ05DMjl2bGU0WWVHbXUyYzdFWGY5eU8wWXZxS1l6UE1VazQwX3h3aVp2bmRyTnlfc2hjdWt2em1ZM2oza29YZFRsUFVD?oc=5",
      "source": "Google News Technology GB",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "gb",
      "published_at": "2025-10-06T00:27:47+00:00"
    },
    {
      "author": "Terrence O’Brien",
      "title": "Jane Goodall’s death triggered the premiere of Netflix’s new show",
      "description": "For the last several years Netflix has been quietly banking episodes of a new show called Famous Last Words, interviews with famous people entering their twilight years. The catch is that episodes will only air after the subject passes away. The full list of interviewees is a closely guarded secret, but last week Netflix quietly posted the premiere episode featuring Jane Goodall.The show is an adaptation of the Danish television series Det Sidste Ord (The Last Word). In the Netflix version Brad Falchuk, best known as the co-creator of American Horror Story and Glee, conducts interviews on an...",
      "url": "https://www.theverge.com/news/792477/jane-goodall-netflix-famous-last-words",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T20:34:15+00:00"
    },
    {
      "author": "Anthony Ha",
      "title": "Suspect arrested after threats against TikTok’s Culver City headquarters",
      "description": "Police say they have arrested a suspect allegedly connected to multiple online threats that led TikTok to evacuate its headquarters near Los Angeles on Friday.",
      "url": "https://techcrunch.com/2025/10/05/suspect-arrested-after-threats-against-tiktoks-culver-city-headquarters/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T18:50:00+00:00"
    },
    {
      "author": "Jackson Chen",
      "title": "OpenAI's first device with Jony Ive could be delayed due to 'technical issues'",
      "description": "OpenAI and Jony Ive could still have some serious loose ends to tie up before releasing their highly anticipated AI device. According to a Financial Times report, the partnership is still struggling with some \"technical issues\" that could ultimately end up pushing back the device's release date, which is expected to be sometime in 2026.One of those lingering dilemmas involves figuring out the AI assistant's voice and mannerisms, according to FT's sources. The AI device is meant to be \"a friend who's a computer who isn't your weird AI girlfriend,\" according to a FT source who was briefed on the...",
      "url": "https://www.engadget.com/ai/openais-first-device-with-jony-ive-could-be-delayed-due-to-technical-issues-182226416.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2Fb45ee950-a214-11f0-a3b2-264553e22483&resize=1400%2C786&client=19f2b5e49a271b2bde77&signature=fdd2d56cba96db01cdc6269d70e9e9c00ba4cf66",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T18:22:26+00:00"
    },
    {
      "author": "Rebecca Bellan",
      "title": "California’s new AI safety law shows regulation and innovation don’t have to clash ",
      "description": "“Are bills like SB 53 the thing that will stop us from beating China? No,” said Adam Billen, vice president of public policy at youth-led advocacy group Encode AI. “I think it is just genuinely intellectually dishonest to say that that is the thing that will stop us in the race.”",
      "url": "https://techcrunch.com/2025/10/05/californias-new-ai-safety-law-shows-regulation-and-innovation-dont-have-to-clash/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T17:51:48+00:00"
    },
    {
      "author": "Terrence O’Brien",
      "title": "If you can get past the terrible logo, Audacity 4 looks pretty great",
      "description": "The new Audacity logo Rebrands rarely get much love. That backlash can be especially strong if you’re giving a facelift to a decades-old piece of software beloved by nerds around the globe. So, it was no surprise that when Audacity revealed its new logo people on the internet got a little worked up. And look, there’s no two ways about it, the logo is pretty bad. The font it quite nice, but the bewildering take on its traditional headphone icon is rough. Reactions around The Verge newsroom included “looks like someone stepped on the apple music icon,” and “trying to decide if their new...",
      "url": "https://www.theverge.com/news/792368/if-you-can-get-past-the-terrible-logo-audacity-4-looks-pretty-great",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T17:37:55+00:00"
    },
    {
      "author": "Lawrence Bonk",
      "title": "This Roomba robot vacuum is on sale for $150 for Prime Day",
      "description": "Robot vacuums are great items to look for during events like October Prime Day. They're usually hundreds of dollars off, so you can save a ton if you're buying one as a gift or you want to upgrade an aging robovac you have at home already. One of the best deals this time around is on the iRobot Roomba 104, which is 40 percent off and on sale for only $150. This is a newer version of the unit that topped our list of the best budget robot vacuums. It's an entry-level robovac that gets the job done. The cleaning motor is fairly powerful and it ships with a multi-surface brush and an edge-sweeping...",
      "url": "https://www.engadget.com/deals/this-roomba-robot-vacuum-is-on-sale-for-150-for-prime-day-164953753.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2Fd9e88cb0-a1ee-11f0-b0ff-dfeb18425f1c&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=4d69a3a20791443b845659f635ddaf8dc714e69d",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T17:01:26+00:00"
    },
    {
      "author": "Jackson Chen",
      "title": "ICE is planning to create a surveillance team that hunts for leads on social media",
      "description": "The US Immigration and Customs Enforcement (ICE) has plans to build out a 24/7/365 surveillance team that focuses on scouring social media for case leads, as revealed in documents first discovered by Wired. According to public records, ICE has put out a request for information — which allows the agency to detail its preliminary scope of work to gauge any interest from contractors — that details using social media platforms like Facebook, X, Instagram, TikTok, Reddit and YouTube to develop leads on wanted individuals.For \"urgent cases,\" the team is expected to work on leads with ICE&#39;s...",
      "url": "https://www.engadget.com/social-media/ice-is-planning-to-create-a-surveillance-team-that-hunts-for-leads-on-social-media-163743143.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2Fe14d4120-a208-11f0-975b-49aee1e9f2a2&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=f8b46d528d602904c81bc67a7b2285de107df55e",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T16:37:43+00:00"
    },
    {
      "author": "Anthony Ha",
      "title": "OpenAI and Jony Ive may be struggling to figure out their AI device",
      "description": "OpenAI and Jony Ive reportedly face significant technical challenges as they work to develop a screen-less, AI-powered device.",
      "url": "https://techcrunch.com/2025/10/05/openai-and-jony-ive-may-be-struggling-to-figure-out-their-ai-device/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T16:34:26+00:00"
    },
    {
      "author": "Sarah Fielding",
      "title": "Prime Day Kindle deals include the second-gen Scribe for $100 off",
      "description": "Amazon devices are already on sale for fall Prime Day. Case in point: the second-gen Kindle Scribe. The E Ink tablet with 16GB of storage is $100 off, down from $400 to $300, which is a record-low price. If you want more storage, the 32GB and 64GB versions are also 25 and 24 percent off, respectively. The Kindle Scribe is our pick for best e-reader E Ink tablet. It scored an 86 in our review, thanks to the smooth reading and writing experience it provides. We were also fans of its sleek and slender design. It has a 10.2-inch screen and offers front lights that auto-adjust to your needs. Our...",
      "url": "https://www.engadget.com/deals/prime-day-kindle-deals-include-the-second-gen-scribe-for-100-off-134701051.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2024-12%2Fd1e16250-b1c4-11ef-b3ff-016a4c2a72a5&resize=1400%2C1050&client=19f2b5e49a271b2bde77&signature=e3b1bbfa6edc132cd095888aae4c29e50a39a7de",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T16:00:38+00:00"
    },
    {
      "author": "Sam Chapman",
      "title": "The best Amazon Prime Day vacuum deals you can get right now: Save on machines from iRobot, Shark, Dyson and others",
      "description": "It's frankly amazing how good vacuum cleaners are these days. Once the laughingstock of the gadget world with their dusty bags and tiny wheels, today's vacuums are sleek dirt-destroying machines, capable of rendering a house habitable no matter how many cats live in it. Some of them are even robots that will do the cleaning for you. For October Prime Day, Amazon has steeply cut the prices of some of the best vacuums (and some pretty good ones alongside). Now is a fantastic time to upgrade your cleaner, so check out the list below for our best recommendations. Best Prime Day vacuum deals Dyson...",
      "url": "https://www.engadget.com/deals/the-best-amazon-prime-day-vacuum-deals-you-can-get-right-now-save-on-machines-from-irobot-shark-dyson-and-others-151504387.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2Fbaf724c0-9df6-11f0-badf-aacb6381861c&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=eff35e49fa6089dbd4a699ee7a00841db1feff5b",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T15:50:37+00:00"
    },
    {
      "author": "Valentina Palladino",
      "title": "The best Amazon Prime Day deals on Anker wireless chargers, power banks and other accessories",
      "description": "Maybe you’re not looking to snag an iPad, a robot vacuum or a VR headset this Amazon Prime Day because you’re set with what you already have. Instead, though, consider picking up a few discounted “essential” gadgets, or really, devices you don’t want to be left without in a pinch. Charging gear falls into this camp, and Anker makes some of our favorite power banks, cables, wireless chargers and more.A bunch of Anker’s gear is on sale for October Prime Day, making now a great time to stock up. Personally, I always end up getting an extra charging cable or surge protector for my house...",
      "url": "https://www.engadget.com/deals/the-best-amazon-prime-day-deals-on-anker-wireless-chargers-power-banks-and-other-accessories-164536013.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2F6163a040-9d57-11f0-a7eb-e279397d304b&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=f98a2d84de9e76a34034accfcf767b893dea9d3e",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T15:20:38+00:00"
    },
    {
      "author": "Sam Chapman",
      "title": "The best Prime Day SSD deals: Save on gear from Samsung, Crucial, Seagate and others",
      "description": "If you've never considered adding a solid-state drive (SSD) to your PC or game console, October Prime Day is a great time to start — and if you already know what a difference extra storage can make, October Prime Day is the perfect time to outfit your build. For those who haven't heard of SSDs, they're physical upgrades that stack on top of a device's storage to make more files accessible at once. The more data a console or PC can hold at a time, the quicker it can retrieve and process that data, which makes everything run faster. Here are the best SSD deals we've managed to find on Amazon...",
      "url": "https://www.engadget.com/deals/the-best-prime-day-ssd-deals-save-on-gear-from-samsung-crucial-seagate-and-others-170039409.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F633e4e30-9ecc-11f0-bfef-d73d9b240932&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=803758604f6581db1b061947c7c5a0a1339f2cd9",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T15:00:35+00:00"
    },
    {
      "author": "Kris Holt",
      "title": "Shark robot vacuums are up to $400 off for Amazon Prime Day",
      "description": "For the Amazon Big Deal Days event (aka October Prime Day), a tasty deal on a Shark robot vacuum has popped up. You'll need to be a Prime member to take advantage of the offer on the Shark AV2501S AI Ultra robot vacuum, but if you are, you can get the device for over half off. The discount drops the price from $550 to $230. That means you can snap up the robot vacuum for $320 below list price. The discount marks a record low for this model. Shark offers several variations of its AI Ultra robot vacuums. There are small variations between them, and a different model is our pick for the best robot...",
      "url": "https://www.engadget.com/deals/shark-robot-vacuums-are-up-to-400-off-for-amazon-prime-day-171836038.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F2548ecf0-a1ee-11f0-8fbd-5c8f512657bd&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=914e87e294da2f432b48b56ff3c083418571467f",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T14:06:25+00:00"
    },
    {
      "author": "Jeff Dunn",
      "title": "The best early October Prime Day deals on Apple devices: Save on AirTags, iPads, Apple Watches and more",
      "description": "If you’ve been waiting for a discount before grabbing a new iPad, MacBook or Apple Watch, Amazon’s October Prime Day sale might be worth checking out. Prime Big Deal Days, as it’s officially called, doesn’t technically begin until October 7, but we’re keeping an eye out for the best Apple deals that are going on in the lead-up to the event. So far, we’ve found a few decent prices on iPads and MacBooks, along with a few modest but early discounts on the recent crop of Apple Watches. You can find our full roundup below, and we’ll be updating this post over the course of the week as...",
      "url": "https://www.engadget.com/deals/the-best-early-october-prime-day-deals-on-apple-devices-save-on-airtags-ipads-apple-watches-and-more-125644340.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F6a585780-9f06-11f0-a7ff-f5c2a2b114ba&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=99dcf314b393c40f96bee81b45bd51196115c805",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T13:50:35+00:00"
    },
    {
      "author": "Valentina Palladino",
      "title": "Prime Day Lego deals: Get up to 56 percent off Star Wars and Super Mario sets",
      "description": "October Prime Day is nearly here, and new early deals are popping up every day. Amazon uses October Prime Day to kickstart the holiday shopping season — even if you haven't even thought about the holidays yet, you should give the latest Prime Day Lego deals a look. A number of Lego sets from the Super Mario and Star Wars collections are already on sale for up to 38 percent off. When shopping for Lego sets on Amazon, we highly recommend checking a price tracker like Keepa or CamelCamelCamel before buying. It's not difficult to find Lego sets \"on sale\" at Amazon, but often those discounted...",
      "url": "https://www.engadget.com/deals/prime-day-lego-deals-get-up-to-56-percent-off-star-wars-and-super-mario-sets-121513566.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2F6d083ca0-9a21-11f0-b6ff-909eff769ed3&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=a836d1affaef85edd80aac429987e1522d0a7166",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T13:46:28+00:00"
    },
    {
      "author": "Kris Holt",
      "title": "The Apple Watch SE 2 is on sale for a record-low price in this Prime Day deal",
      "description": "If, like me, you're wondering how it could possibly be October already, perhaps you need a watch. Probably one with a calendar function. Strangely enough, there are some solid deals on several Apple Watch models right now ahead of&nbsp;Amazon's Prime Big Deal Days event. The second-gen Apple Watch SE with LTE connectivity has&nbsp;dropped to $189, which is a discount of $110 or 37 percent. That's a new record low price for this 40mm variant with a small/medium band. The discount applies to versions with an ink sport loop and denim sport band. It's worth bearing in mind that this deal is for the...",
      "url": "https://www.engadget.com/deals/the-apple-watch-se-2-is-on-sale-for-a-record-low-price-in-this-prime-day-deal-162845820.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F7533b750-a1ed-11f0-bff7-5cb92f40fe7c&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=1b5883866c12d7f31f93bf57c587bccf4aa6ff1e",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T13:46:27+00:00"
    },
    {
      "author": null,
      "title": "YouTuber reaches Minecraft’s legendary Far Lands after 14-plus-year journey - Dexerto",
      "description": "YouTuber reaches Minecraft’s legendary Far Lands after 14-plus-year journey&nbsp;&nbsp;Dexerto14 years after he began, streamer makes Minecraft history as he completes marathon walk to the edge of the world&nbsp;&nbsp;PCGamesNAfter 14 Years And 12 Million Blocks, Minecraft YouTuber KurtJMac Has Finally Reached The Far Lands&nbsp;&nbsp;TheGamerIt took 14 years for a streamer to walk to the Far Lands in Minecraft, but his long journey is finally over&nbsp;&nbsp;PC GamerWho is KurtJMac? Streamer set to reach the end of the world in Minecraft after 14 years&nbsp;&nbsp;Soap Central",
      "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQT1JzNFRGNkIyRlZIS3VCMUYyUGdwY1BfMVNRYmNYYlFPSHpwSDJCSlc2UmJ1SUV1NlRLaXcya1pBNmpQM3p5YjQ5djZpWmVOMUNPaUM0ZWJwZUp4Z0ZTWVoxOVMtdDhfc1h3STRtcGhmbVlUZF9CdDN6U1k0b1N5aERvNEkxYU1jdkZETFVFd1o2d3RNWmotbHl3cUZzRjc2ajlGdWVnSEpDNmdlOGlVT1FJcS0wMWY0?oc=5",
      "source": "Google News Technology GB",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "gb",
      "published_at": "2025-10-05T13:10:19+00:00"
    },
    {
      "author": "Andrew J. Hawkins",
      "title": "Can tap-to-pay save public transportation?",
      "description": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on the intersection of transportation and technology, follow Andrew J. Hawkins. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here.How it startedI vividly remember the first time I used my phone to ride the New York City subway. I tapped my device against the translucent rectangle thing, the light turned green, and the turnstile made a familiar click inviting me to push through the metal arms. On the other side, the future beckoned. After a two-decade...",
      "url": "https://www.theverge.com/column/789127/tap-to-pay-public-transportation",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T12:00:00+00:00"
    },
    {
      "author": "Lisa Wood Shapiro",
      "title": "7 Best Dehumidifiers for Cool and Dry Home Air (2025)",
      "description": "If you care about good air, it’s time for a dehumidifier. These are the best ones we've tested for everything from basements to drying laundry.",
      "url": "https://www.wired.com/gallery/best-dehumidifier/",
      "source": "Wired",
      "image": "https://media.wired.com/photos/68e1fff9bbb360ed6b666786/master/pass/The%20Best%20Dehumidifiers%20to%20Keep%20Your%20Home%20Cool%20and%20Dry.png",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-05T10:07:00+00:00"
    },
    {
      "author": "Anthony Ha",
      "title": "Newsom signs bill giving Uber and Lyft drivers in California the right to unionize",
      "description": "Drivers for ride-hailing apps like Uber and Lyft will soon have the right to unionize in California as independent contractors, thanks to a bill signed Friday by Governor Gavin Newsom.",
      "url": "https://techcrunch.com/2025/10/04/newsom-signs-bill-giving-uber-and-lyft-drivers-in-california-the-right-to-unionize/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T20:57:33+00:00"
    },
    {
      "author": "Anthony Ha",
      "title": "If you’re not an AI startup, good luck raising money from VCs",
      "description": "New PitchBook data illustrates how dramatically AI is dominating startup investment, with 2025 on-track to become the first year when AI accounts for more than half of all VC money invested.",
      "url": "https://techcrunch.com/2025/10/04/if-youre-not-an-ai-startup-good-luck-raising-money-from-vcs/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T20:05:28+00:00"
    },
    {
      "author": "Jackson Chen",
      "title": "OpenAI acquires an AI-powered personal investing app",
      "description": "Just a day after dethroning SpaceX as the most valuable private company in the world, OpenAI has acquired another startup. This time, the AI giant acquired Roi, an app that offers a one-stop shop for all your financial portfolios and an AI chatbot that provides personalized investing advice. Details of the acquisition weren&#39;t made public, but TechCrunch reported that Sujith Vishwajith, the startup&#39;s CEO and co-founder, will be the only one joining OpenAI&#39;s team.It might come as a surprise for OpenAI to venture into the personal finance space, but this latest acquisition offers some...",
      "url": "https://www.engadget.com/ai/openai-acquires-an-ai-powered-personal-investing-app-192339271.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2Fc94ba220-a153-11f0-bf5f-d932ee2bad71&resize=1400%2C875&client=19f2b5e49a271b2bde77&signature=ff00601a423d0ab196bb4923bb02e52964510b0a",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T19:23:39+00:00"
    },
    {
      "author": "Kirsten Korosec",
      "title": "Startups and the U.S. government: It’s getting complicated",
      "description": "Equity co-hosts Anthony Ha, Kirsten Korosec, and Max Zeff explore the how startups are navigating a topsy-turvy relationship with the U.S. government.",
      "url": "https://techcrunch.com/2025/10/04/startups-and-the-u-s-government-its-getting-complicated/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T19:10:05+00:00"
    },
    {
      "author": "Cheyenne MacDonald",
      "title": "What to read this weekend: Ghost stories to kick off October",
      "description": "Here are some recently released titles to add to your reading list. This week, we read Bora Chung's Midnight Time: A Novel in Ghost Stories, and started a new series from Mad Cave Studios, It Killed Everyone But Me. This article originally appeared on Engadget at https://www.engadget.com/entertainment/what-to-read-this-weekend-ghost-stories-to-kick-off-october-182937425.html?src=rss",
      "url": "https://www.engadget.com/entertainment/what-to-read-this-weekend-ghost-stories-to-kick-off-october-182937425.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F4ae81f20-a14f-11f0-bedd-fab9ff7265e5&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=9e0724a9f98819e431b3dfa800b1ac6f92e02e08",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T18:29:38+00:00"
    },
    {
      "author": "Lorenzo Franceschi-Bicchierai",
      "title": "Anker offered Eufy camera owners $2 per video for AI training",
      "description": "Hundreds of Eufy customers have donated hundreds of thousands of videos to train the company’s AI systems.",
      "url": "https://techcrunch.com/2025/10/04/anker-offered-to-pay-eufy-camera-owners-to-share-videos-for-training-its-ai/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T18:19:42+00:00"
    },
    {
      "author": "Jeff Dunn",
      "title": "The best October Prime Day TV deals: Early discounts on sets from Sony, Samsung, TCL and others",
      "description": "It’s time for another October Prime Day sale, and that means Amazon is selling a number of well-regarded TVs for lower prices than usual. Not every deal is exclusive to the event, and it’s still more than possible that these sets drop even further as we get closer to Black Friday. For now, though, a few recommended sets from the likes of TCL, Hisense, Samsung and Sony are on sale. We’ve rounded up all the best October Prime Day TV deals we’ve seen thus far below, and we’ll update this post as more arise. Just note that you may need to be an Amazon Prime subscriber to access some of...",
      "url": "https://www.engadget.com/deals/the-best-october-prime-day-tv-deals-early-discounts-on-sets-from-sony-samsung-tcl-and-others-180051602.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F6c0d8050-9fb0-11f0-b7df-03b03f8d9acc&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=369c35296e449522f741184da8baa83146b32394",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T17:30:35+00:00"
    },
    {
      "author": "Sheena Vasani",
      "title": "This week&#8217;s best deal is a &#8216;kids&#8217; Kindle Paperwhite that&#8217;s better than the adult version",
      "description": "Amazon’s Prime Big Deal Days may bring some great Kindle deals, but if you can’t wait, you don’t have to. Right now, the Kindle Kids (Amazon, Best Buy, and Target) and Kindle Colorsoft Kids (Amazon, Best Buy, and Target) are down to their lowest prices ever, but my favorite deal is on the Kindle Paperwhite Kids, which sits nicely between the two. Normally $179.99, right now it’s on sale for $134.99 ($45 off) at Amazon, Best Buy, and Target.Although marketed as a kid-friendly e-reader, the Paperwhite Kids is actually a great value for adults, too. The 7-inch slate is nearly identical to...",
      "url": "https://www.theverge.com/tech/791728/kindle-paperwhite-kids-sonos-era-100-deal-sale",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T17:00:00+00:00"
    },
    {
      "author": "Andre Revilla",
      "title": "Pick up this battery-powered Ring doorbell while it's 47 percent off for Prime Day",
      "description": "The Ring Battery Doorbell Plus is on sale for almost half off and is at the lowest price we've ever seen for this model. Normally retailing for $150, the smart doorbell is on sale for $80, a discount of 47 percent. This aggressive sale comes ahead of another Prime Day that runs October 7-8. The Battery Doorbell Plus offers a 150-by-150-degree \"head to toe\" field of vision and 1536p high-resolution video. This makes it a lot easier to see boxes dropped off at your front door since it doesn't cut off the bottom of the image like a lot of video doorbells. This model features motion detection...",
      "url": "https://www.engadget.com/deals/pick-up-this-battery-powered-ring-doorbell-while-its-47-percent-off-for-prime-day-154508948.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F147dd0d0-a12f-11f0-bf7f-9228cdc7f2d4&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=8784eb1331b7fedcd554876331b831772b9f7c76",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T16:36:25+00:00"
    },
    {
      "author": "Anthony Ha",
      "title": "Sam Altman says Sora will add ‘granular,’ opt-in copyright controls",
      "description": "OpenAI may be reversing course on how it approaches copyright and intellectual property in its new video app Sora.",
      "url": "https://techcrunch.com/2025/10/04/sam-altman-says-sora-will-add-granular-opt-in-copyright-controls/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T16:26:50+00:00"
    },
    {
      "author": "Valentina Palladino",
      "title": "Prime Day Lego deals include up to 38 percent off Star Wars and Super Mario sets",
      "description": "With October Prime Day comes deals on all sorts of things, including tech and toys. Amazon has used the event to kickstart the holiday shopping season for the past few years, making it a good time to pick up early gifts for less and stock up on things for yourself without spending full price. Maybe you haven’t even thought about the holidays yet, but it’s worth giving the latest Prime Day Lego deals a look. A number of Lego sets from the Super Mario and Star Wars collections are already on sale for up to 38 percent off. When shopping for Lego sets on Amazon, we highly recommend checking a...",
      "url": "https://www.engadget.com/deals/prime-day-lego-deals-include-up-to-38-percent-off-star-wars-and-super-mario-sets-121513510.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2F6d083ca0-9a21-11f0-b6ff-909eff769ed3&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=a836d1affaef85edd80aac429987e1522d0a7166",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T14:45:54+00:00"
    },
    {
      "author": "Sheena Vasani",
      "title": "Ecovacs’ Deebot X8 and X9 Pro Omni robovacs have hit a new low price",
      "description": "The robovac comes with a dock that can refill itself using its built-in water tank. Robot vacuums that mop well rarely come cheap, but thankfully, some of our favorite models are receiving a significant discount ahead of Amazon’s next Prime Day event next week. Right now, the Ecovacs Deebot X8 Pro Omni and the newer Deebot X9 Pro Omni are on sale at Amazon for Prime members for $799.99 ($300 off) and $899.99 ($400 off), respectively, which is the lowest price we’ve seen on either model.The Deebot X8 Pro Omni is an excellent robot vacuum and mop hybrid, with an extendable roller mop that...",
      "url": "https://www.theverge.com/tech/791106/ecovacs-deebot-x8-x9-pro-omni-robot-vacuum-prime-day-deal-sale",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T14:41:43+00:00"
    },
    {
      "author": "Kris Holt",
      "title": "Apple's 25W MagSafe charger is only $35 with this Prime Day deal",
      "description": "On the heels of the iPhone 17 lineup being released a few weeks ago, you can pick up Apple's 25W MagSafe charger for a song. The two-meter version of the more powerful charging cable has dropped by 29 percent from $49 to $35. That's a record-low price. As it happens, that actually makes the two-meter version of the cable less expensive than the one-meter variant. The shorter cable will run you $39 as things stand. If you have an iPhone 16, iPhone 17 or iPhone Air, this cable can charge your device at 25W as long as it's connected to a 30W power adapter on the other end. While you'll need a more...",
      "url": "https://www.engadget.com/deals/apples-25w-magsafe-charger-is-only-35-with-this-prime-day-deal-143415981.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2024-09%2F1a460840-6ee8-11ef-bfff-be3868139751&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=c26852ac5d5bf272e87e1704dee891548c17a0ae",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T14:16:27+00:00"
    },
    {
      "author": "Valentina Palladino",
      "title": "The best Amazon Prime Day deals: Get up to 57 percent off gear from Apple, Shark, Anker, Dyson, Samsung and others",
      "description": "Now that we know October Prime Day is on the horizon, it’s time to start thinking about what you may want to snag at a discount during the sale. If you pay the $139 annual fee for Prime, sale events like these are a great time to stock up on essentials and cross things off your wishlist while you can save some money.Most discounts will be exclusively available to Prime subscribers, but there are always a few that anyone shopping on Amazon can grab. Similarly, there are always early deals in the days and weeks leading up to Prime Day, and this year is no different. Here, we’ve collected the...",
      "url": "https://www.engadget.com/deals/the-best-amazon-prime-day-deals-get-up-to-57-percent-off-gear-from-apple-shark-anker-dyson-samsung-and-others-050801311.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-06%2F70db59a0-4acd-11f0-bd1b-a6a20e1c0e4f&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=e76d2c7a9269e2ef4335c701c4bb3a217e857a5a",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T14:06:27+00:00"
    },
    {
      "author": "Mariella Moon",
      "title": "Discord users' IDs and data compromised in customer service provider hack",
      "description": "One of Discord&#39;s third-party customer service providers has been infiltrated by an unauthorized party who was able to gain access to users&#39; information. Discord said it recently discovered the incident, which took place on September 20. The compromised data includes a \"small number\" of government IDs like driver&#39;s licenses and passports, which some users may have submitted to verify their ages. To be clear, Discord itself wasn&#39;t hacked, and you would only be affected by the data breach if you&#39;ve ever communicated with the messaging service&#39;s Customer Support or Trust...",
      "url": "https://www.engadget.com/apps/discord-users-ids-and-data-compromised-in-customer-service-provider-hack-140053655.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2Fb8634db0-a11b-11f0-b6ad-eb951e9cbfb5&resize=1400%2C874&client=19f2b5e49a271b2bde77&signature=a9867bc167fbbd8d4b3edf92140d43bc0250850d",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T14:00:53+00:00"
    },
    {
      "author": "Charles Pulliam-Moore",
      "title": "Tilly Norwood is a gen AI psyop",
      "description": "Last week at the Zurich Film Festival, Eline Van der Velden - founder and CEO of AI production house Particle6 and its subsidiary talent studio Xicoia - said that a number of talent agents had expressed interest in working with Tilly Norwood, an AI-generated \"actress\" created by the companies. Van der Velden has not gone into detail about which agencies might be contemplating whether they should bring Norwood (and by extension, Xicoia) on as clients. But simply saying that agents have come knocking was enough to get the entertainment industry trades buzzing and posting stories about how Norwood...",
      "url": "https://www.theverge.com/ai-artificial-intelligence/791680/tilly-norwood-particle6-xicoia-eline-van-der-velden",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T14:00:00+00:00"
    },
    {
      "author": "Sean O'Kane",
      "title": "Tesla’s insurance arm accused of ‘egregious delays’ and ‘systemic failures’ by CA regulator",
      "description": "California's Department of Insurance has been warning Tesla to fix its claims process since 2022, but consumer complaints have skyrocketed anyways.",
      "url": "https://techcrunch.com/2025/10/04/teslas-insurance-arm-accused-of-egregious-delays-and-systemic-failures-by-ca-regulator/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T13:29:23+00:00"
    },
    {
      "author": "Louryn Strampe",
      "title": "8 Best Coffee Pod Machines We Tested for Lickety-Split Caffeine Delivery (2025)",
      "description": "Pod coffee makers are a convenient way to get caffeinated. Of the eight we've tried so far, the Bruvi BV-01 is our top pick.",
      "url": "https://www.wired.com/gallery/best-pod-coffee-makers/",
      "source": "Wired",
      "image": "https://media.wired.com/photos/6830e72347797e411f30e85b/master/pass/The%20Best%20Coffee%20Pod%20Machines%20for%20Hot%20and%20Cold%20Brew.png",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T10:32:00+00:00"
    },
    {
      "author": "Connie Loizos",
      "title": "Bezos predicts that millions will live in space kind of soon",
      "description": "Amazon founder Jeff Bezos made a rare public appearance at Italian Tech Week in Turin on Friday and used the opportunity to predict that millions of people will be living in space &#8220;in the next couple of decades,&#8221; the Financial Times reports. Speaking with John Elkann, a scion of Italy&#8217;s Agnelli dynasty, Bezos, who also [&#8230;]",
      "url": "https://techcrunch.com/2025/10/03/bezos-predicts-that-millions-will-live-in-space-kind-of-soon/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T06:38:25+00:00"
    },
    {
      "author": "Sarah Jeong",
      "title": "Oregon’s National Guard lawsuit hinges on Trump’s Truth Social posts",
      "description": "After getting off the phone with Oregon Governor Tina Kotek on Saturday, the president mused over something that had baffled him about the call. Kotek had been \"very nice,\" said Trump. But she was trying hard to convince him not to send in the National Guard, and that just didn't make any sense to him. \"But I said, 'Well wait a minute, am I watching things on television that are different from what's happening?'\" Hours later, Defense Secretary Pete Hegseth issued a memorandum federalizing 200 members of Oregon's National Guard to deploy to Portland, and the state of Oregon promptly filed suit...",
      "url": "https://www.theverge.com/policy/792042/trump-oregon-national-guard-tro",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-04T00:22:16+00:00"
    },
    {
      "author": "Jay Peters",
      "title": "Discord customer service data breach leaks user info and scanned photo IDs",
      "description": "One of Discord’s third-party customer service providers was compromised by an “unauthorized party,” the company says. The unauthorized party gained access to “information from a limited number of users who had contacted Discord through our Customer Support and/or Trust & Safety teams” and aimed to “extort a financial ransom from Discord.” The unauthorized party “did not gain access to Discord directly.”Data potentially accessed by the hack includes things like names, usernames, emails, and the last four digits of credit card numbers. The unauthorized party also accessed a “...",
      "url": "https://www.theverge.com/news/792032/discord-customer-service-data-breach-hack",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T23:52:50+00:00"
    },
    {
      "author": "Rebecca Bellan",
      "title": "With its latest acqui-hire, OpenAI is doubling down on personalized consumer AI ",
      "description": "OpenAI is acquiring the CEO of Roi, an AI financial companion. Roi will sunset its service as its talent heads to OpenAI, ostensibly to help boost revenue in consumer apps.",
      "url": "https://techcrunch.com/2025/10/03/with-its-latest-acqui-hire-openai-is-doubling-down-on-personalized-consumer-ai/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T22:52:14+00:00"
    },
    {
      "author": "Marina Temkin",
      "title": "Sources: Naveen Rao’s new AI hardware startup targets $5B valuation with backing from a16z ",
      "description": "Former Databricks AI chief is raising $1 billion to build a Nvidia rival through a novel approach.",
      "url": "https://techcrunch.com/2025/10/03/sources-naveen-raos-new-ai-hardware-startup-targets-5b-valuation-with-backing-from-a16z/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T21:56:58+00:00"
    },
    {
      "author": null,
      "title": "TrueVault (YC W14) Is Hiring a BDR (Ex-ECommerce Manager)",
      "description": "Comments",
      "url": "https://www.ycombinator.com/companies/truevault/jobs/FaC8Apo-ecommerce-manager-bdr",
      "source": "Hacker News",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T21:00:32+00:00"
    },
    {
      "author": "Maxwell Zeff",
      "title": "What to expect at OpenAI’s DevDay 2025, and how to watch it",
      "description": "OpenAI's third-ever developer conference is around the corner, and it's shaping up to be the company's biggest yet.",
      "url": "https://techcrunch.com/2025/10/03/what-to-expect-at-openais-devday-2025-and-how-to-watch-it/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T19:36:47+00:00"
    },
    {
      "author": "Anna Lagos",
      "title": "Bad Bunny Has MAGA All Worked Up",
      "description": "After avoiding the continental US on his world tour due to ICE, Bad Bunny’s Super Bowl halftime show will be a battleground for the country’s culture wars.",
      "url": "https://www.wired.com/story/bad-bunny-has-maga-all-worked-up/",
      "source": "Wired",
      "image": "https://media.wired.com/photos/68dff575a442efb1aa235cbc/master/pass/badbunny-maga-cul-2213606828.jpg",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T19:36:11+00:00"
    },
    {
      "author": "Alex Heath",
      "title": "Tales from the AI hiring frenzy",
      "description": "This is an excerpt of Sources by Alex Heath, a newsletter about AI and the tech industry, syndicated just for The Verge subscribers once a week.The billboard didn't say \"Listen Labs.\" It didn't say anything about hiring. It consisted of just a plain white background with \"https://\" and a single line of grouped numbers hanging over Nob Hill, San Francisco. Last month, Alfred Wahlforss, the startup's CEO, posted on X that whoever cracked the code and completed a subsequent challenge would win a trip to Berlin and get on the guest list for the ultra-exclusive nightclub Berghain.One of the more...",
      "url": "https://www.theverge.com/column/791572/ai-hiring-frenzy-startup-challenges",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T19:30:00+00:00"
    },
    {
      "author": "Ian Carlos Campbell",
      "title": "Google is also removing apps used to report sightings of ICE agents",
      "description": "Following Apple&#39;s removal of ICEBlock from the App Store, an app used to report on the activity of Immigration and Customs Enforcement agents, 404 Media reports that Google is also removing similar apps from the Play Store. In a statement to Engadget, Google said \"ICEBlock was never available on Google Play, but we removed similar apps for violations of our policies.\"Google says that it decided to remove apps that shared the location of a vulnerable group following a violent act that involved the group and a similar collection of apps. It suggests the apps were also removed because they...",
      "url": "https://www.engadget.com/apps/google-is-also-removing-apps-used-to-report-sightings-of-ice-agents-192940612.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2F8c89c4b0-a08c-11f0-bf6d-828ca3856cca&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=354dfd1fc56a32a8807642fefbeeb8a1a6ef91e5",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T19:29:40+00:00"
    },
    {
      "author": "Jay Peters",
      "title": "Unity discloses a years-old security exploit and urges developers to update their games",
      "description": "Unity is urging developers to take “immediate action” after it disclosed a major security vulnerability affecting games built using versions of its popular development tool dating back to 2017. While there is “no evidence of any exploitation of the vulnerability, nor has there been any impact on users or customers,” Unity already has fixes available to developers, according to a post from Larry Hryb, aka “Major Nelson.” Specifically, developers need to take action if “you have developed and released a game or application using Unity 2017.1 or later for Windows, Android, or macOS...",
      "url": "https://www.theverge.com/news/791609/unity-security-exploit-developers-update-games",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T19:23:14+00:00"
    },
    {
      "author": "Sarah Perez",
      "title": "Google’s Gemini AI app could soon be getting a big makeover",
      "description": "Google's Gemini AI app is getting a redesign with suggested prompts, a reverse engineer finds.",
      "url": "https://techcrunch.com/2025/10/03/googles-gemini-ai-app-could-soon-be-getting-a-big-makeover/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T19:18:43+00:00"
    },
    {
      "author": "Emma Roth",
      "title": "Google removes ICE-spotting app following Apple’s ICEBlock crackdown",
      "description": "Just one day after Apple took down the iOS App Store listing for ICEBlock, Google has confirmed to 404 Media that it has removed a similar app, Red Dot, from the Google Play Store. The company also reportedly said it “removed apps that share the location of what it describes as a vulnerable group after a recent violent act against them connected to this sort of app.”&nbsp;On Thursday, Apple removed ICEBlock and similar apps, including Red Dot, after facing pressure from the Department of Justice. Attorney General Pam Bondi said to Fox News on Thursday that “ICEBlock is designed to put ICE...",
      "url": "https://www.theverge.com/news/791533/google-apple-ice-tracking-app-store-red-dot-iceblock",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T19:09:25+00:00"
    },
    {
      "author": "Sean O'Kane",
      "title": "Rivian is redesigning the R2 SUV’s door handles for better safety",
      "description": "The change comes after employees and customers reportedly voiced concerns.",
      "url": "https://techcrunch.com/2025/10/03/rivian-is-redesigning-the-r2-suvs-door-handles-for-better-safety/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T18:47:56+00:00"
    },
    {
      "author": "Amanda Silberling",
      "title": "Can you think like a YC partner? This game will help you find out",
      "description": "The YC Partner Simulator game, created by an undergrad in Berlin, lets you see if you can predict what startups get into Y Combinator.",
      "url": "https://techcrunch.com/2025/10/03/can-you-think-like-a-yc-partner-this-game-will-help-you-find-out/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T18:36:53+00:00"
    },
    {
      "author": "Theresa Loconsolo",
      "title": "Can AI companies turn brainrot into revenue?",
      "description": "The U.S. government shutdown that began this week is the first in seven years. While it might not feel immediately disruptive, for startups waiting on permits, visas, or regulatory approvals, even a few weeks can become an existential problem.&#160; On this episode of Equity, Kirsten Korosec, Anthony Ha, and Max Zeff talk through how uncertainty [&#8230;]",
      "url": "https://techcrunch.com/video/can-ai-companies-turn-brainrot-into-revenue/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T18:19:55+00:00"
    },
    {
      "author": "Julie Bort",
      "title": "Supabase nabs $5B valuation, four months after hitting $2B",
      "description": "It's been a wild year of growth and fundraising for vibe-coding database of choice, Supabase.",
      "url": "https://techcrunch.com/2025/10/03/supabase-nabs-5b-valuation-four-months-after-hitting-2b/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T18:14:03+00:00"
    },
    {
      "author": "Sarah Fielding",
      "title": "Prime Day deal: The second-gen Kindle Scribe is $100 off",
      "description": "We're only one week away from Amazon Prime Day and the sales have already started. The deals include Amazon's devices, from Kindle tablets to Echo speakers. Take the Amazon Kindle Scribe, which has dropped to $300 from $400. The 25 percent discount brings the second-generation device back down to its all-time low price. This deal is available on the 16GB model in Tungsten (dark grey) and doesn't include Kindle Unlimited. If you want more storage, the 32GB and 64GB versions are also 25 and 24 percent off, respectively. The Kindle Scribe is our pick for best e-reader E Ink tablet. It scored an 86...",
      "url": "https://www.engadget.com/deals/prime-day-deal-the-second-gen-kindle-scribe-is-100-off-134701372.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2024-12%2Fd1e16250-b1c4-11ef-b3ff-016a4c2a72a5&resize=1400%2C1050&client=19f2b5e49a271b2bde77&signature=e3b1bbfa6edc132cd095888aae4c29e50a39a7de",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T18:00:37+00:00"
    },
    {
      "author": "Andrew J. Hawkins",
      "title": "Tesla’s cheaper Model Y finally breaks cover",
      "description": "Tesla’s long-rumored more affordable electric vehicle won’t be out until next year, but it was recently spotted uncamouflaged on a highway in Texas. And no, your eyes are not fooling you; it’s just a cheaper version of the Model Y.The rumor that the affordable EV would just be a bare-bones Model Y has been circulating ever since Elon Musk canceled a previous model that was to be built on an entirely new platform. The so-called “Model 2” was meant to be&nbsp;Musk’s long-promised “$25,o00 EV”&nbsp;that at one point was presented as having&nbsp;a Cybertruck-inspired design. Musk...",
      "url": "https://www.theverge.com/news/791414/tesla-model-y-cheap-affordable-photos-leak",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T18:00:17+00:00"
    },
    {
      "author": "Hayden Field",
      "title": "I’ve fallen into Sora’s slippery slop",
      "description": "I’m not running. I’m frolicking. An anime version of Jesus Christ flipping tables. OpenAI employees performing in Hamilton costumes. News anchors discussing a story on television. A man doing a thirst-trap TikTok dance. Sam Altman - stealing GPUs on CCTV, listening to a business pitch, crying. Such were the contents of my feed on Sora, OpenAI's new social media app for AI-generated video. The company released the iOS app on Tuesday with the ability to create 10-second videos of virtually anything you can dream up, including \"cameos,\" or videos featuring your own AI-generated self and anyone...",
      "url": "https://www.theverge.com/ai-artificial-intelligence/791290/openai-sora-ai-generated-video-hands-on",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T17:08:32+00:00"
    },
    {
      "author": "Amy Skorheim",
      "title": "Early Amazon Prime Day tech deals under $50: Save on gear from Apple, Anker, Ring, JBL and Roku ahead of next week's sale",
      "description": "You can snap up a lot of useful tech for less than $50 during Amazon’s October Prime Day sale. Even though the sale doesn't officially kick off until Tuesday, we’re already seeing discounts on mini speakers, earbuds, power banks, wall chargers, and even our favorite budget air fryer — for less than $50. In fact, all the deals highlighted here are pulled from our own testing and we'll tell you why we like it, too. If you’re on the hunt for small electronics and accessories — or if you just want to get in on the sale without spending too much — this list of the best Prime Day deals...",
      "url": "https://www.engadget.com/deals/early-amazon-prime-day-tech-deals-under-50-save-on-gear-from-apple-anker-ring-jbl-and-roku-ahead-of-next-weeks-sale-120531666.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2F0d777110-9b17-11f0-adee-3b7181fa4b6b&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=01dc6f708d9c7c142eda260b1305e862678941f3",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T17:01:26+00:00"
    },
    {
      "author": "Matt Tate",
      "title": "A free, ad-supported Xbox Cloud Gaming option might be on the way",
      "description": "It’s been quite the week for Xbox news. A lot of people are still coming to terms with Microsoft&#39;s veritable gut-punch of announcement that the price of a Game Pass Ultimate subscription is about to soar by 50 percent. And if that has already pushed you into washing your hands with Xbox altogether, it looks like Microsoft may soon attempt to tempt you back by giving away its cloud gaming service for free. That is, an extremely limited version of it, with ads.According to The Verge, Microsoft is preparing to announce an ad-supported version of Xbox Cloud Gaming, which finally exited beta...",
      "url": "https://www.engadget.com/gaming/xbox/a-free-ad-supported-xbox-cloud-gaming-option-might-be-on-the-way-165739468.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-10%2Fbc74a9c0-a077-11f0-b63c-60ec91180bbe&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=c86311693bc1769262aaa73e62a713c66ab4b174",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T16:57:39+00:00"
    },
    {
      "author": "Tina Nguyen",
      "title": "Trump rolled YouTube into paying for his ballroom",
      "description": "About two months ago, John P. Coale, one of many lawyers representing Donald Trump in a personal capacity, met with several Alphabet executives, mediators, and lawyers at Mar-a-Lago - along with his client. They all spent a lovely day at the palatial Florida estate, and Trump treated them to lunch as they chatted about anything but the antitrust cases being prosecuted against Google. Coale was keen not to broach the matter, he told The Verge in an interview, since \"it could be dicey.\" Whenever someone else skirted the topic of the antitrust cases - \"not Google and not me,\" he was quick to...",
      "url": "https://www.theverge.com/policy/791355/trump-youtube-google-antitrust-ballroom",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T16:52:15+00:00"
    },
    {
      "author": "Sarah Perez",
      "title": "OpenAI’s Sora soars to No. 1 on the US App Store",
      "description": "Sora becomes the No. 3 US app after 164K downloads in 2 days, making the AI video app an early hit.",
      "url": "https://techcrunch.com/2025/10/03/openais-sora-soars-to-no-1-on-the-u-s-app-store/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T16:48:32+00:00"
    },
    {
      "author": "Amy Skorheim",
      "title": "The best live TV streaming services to cut cable in 2025",
      "description": "If you’re interested in a live TV streaming service, you’re probably looking for one (or all three) of the following: current sports matchups, breaking news and linear, cable-like channels. There are plenty of providers out there and we tried them all out to see what you get for your monthly bill — especially since every live TV streamer has raised prices over the past year or two. That said, in most markets, a live TV streaming service is still more cost-effective than cable. And you still don’t have to sign a contract. Right now, we think YouTube TV is the most well-rounded option...",
      "url": "https://www.engadget.com/entertainment/streaming/best-live-tv-streaming-service-133000410.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2024-12%2Fdf0bddc0-bd68-11ef-be39-da0a62e03075&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=4fc99c769114285c257f046ef37a9875decf51fd",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T16:00:38+00:00"
    },
    {
      "author": "Jay Peters",
      "title": "Sony shrinks PS5 Slim storage in the US, too",
      "description": "Sony is now selling a revised model of the digital PS5 slim in the US that has less storage than the original version. The updated model with 825GB of internal SSD storage instead of 1TB recently went on sale in Europe, but now it’s available to buy on the US PlayStation Direct website as well.&nbsp;The revised digital edition console, which Sony says is in the “CFI-2100 model group – slim,” still starts at $499.99, even with the reduced storage space. YouTuber Austin Evans recently tore down one of the updated PS5 slim consoles from Europe, and in addition to less storage, Evans...",
      "url": "https://www.theverge.com/news/791380/sony-ps5-slim-reduced-storage-2100-model-series",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T15:39:41+00:00"
    },
    {
      "author": "Andrew Liszewski",
      "title": "Hoto put a lo-fi torque display on its new cordless screwdriver",
      "description": "The pixelated display is no frills but easy to read. | Image: Hoto Hoto’s latest electric screwdriver introduces a couple of novel usability improvements. Now, you’ll find a pixelated display on the business end of the driver showing details like its remaining battery life, while a multi-function button lets you adjust its speed and switch directions with just one finger.The new PixelDrive features a similarly sleek design as the company’s previous electric drivers. But the added screen — and added power — means it’s also a bit larger than the company’s other offerings. Hoto’s...",
      "url": "https://www.theverge.com/news/791260/hoto-pixeldrive-cordless-screwdriver-display",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T15:39:35+00:00"
    },
    {
      "author": "Terrence O’Brien",
      "title": "Kodak launches Kodacolor 100 and 200 to feed the film resurgence",
      "description": "It’s been a while since Kodak launched a new film, and even longer since it actually distributed its own. But the company caught people by surprise yesterday when it announced two new film products — Kodacolor 100 and Kodacolor 200. Just as important, it announced that it would be distributing them itself, rather than going through Kodak Alaris, which has handled distribution since the company split following bankruptcy proceedings in 2012.In an Instagram post Kodak described Kodacolor as “sub-brands of existing Kodak films,” meaning they’re not completely new film stock. My suspicion...",
      "url": "https://www.theverge.com/news/791251/kodak-launches-kodacolor-100-and-200-to-feed-the-film-resurgence",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T15:24:09+00:00"
    },
    {
      "author": "Tom Warren",
      "title": "Microsoft is about to launch free Xbox Cloud Gaming with ads",
      "description": "Microsoft is getting ready to announce an ad-supported version of Xbox Cloud Gaming. Sources familiar with Microsoft's plans tell The Verge that the software maker has started testing ad-supported games streaming internally, allowing employees to play select titles free without a Game Pass subscription.I understand that the free ad-supported version of Xbox Cloud Gaming will include the ability to stream some games you own, as well as eligible Free Play Days titles, which let Xbox players try games over a weekend. You'll also be able to stream Xbox Retro Classics games.Sources tell me the...",
      "url": "https://www.theverge.com/report/791213/xbox-cloud-gaming-free-ad-supported-version",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T15:18:15+00:00"
    },
    {
      "author": "Mia Sato",
      "title": "The quest for every Gap store playlist ever",
      "description": "In August 2002, I was probably back-to-school shopping with my mom at our local mall, bouncing from store to store for backpacks, socks, and a first-day-of-school outfit. Gap was no doubt one of our stops - and thanks to Michael Bise, I now know what music was playing as we browsed.When Bise first started working at a Gap store in Dallas in 1992, the first thing that struck him was the store's music.\"Just right away, it was so different from what I was expecting,\" Bise says. It wasn't the classic soft instrumentals of a chain department store, nor was it pop radio hits. There was house, dance...",
      "url": "https://www.theverge.com/report/790802/gap-playlists-michael-bise-music-streaming-nostalgia",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T15:06:10+00:00"
    },
    {
      "author": "Tim De Chant",
      "title": "Leaked doc reveals the chaotic politics behind Trump Energy Department cuts",
      "description": "Harris-voting states were hit hardest by Department of Energy award cancellations, but not every blue-state project was cut. Politics might play a role.",
      "url": "https://techcrunch.com/2025/10/03/leaked-doc-reveals-the-chaotic-politics-behind-trump-energy-department-cuts/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T15:04:58+00:00"
    },
    {
      "author": "Emma Roth",
      "title": "Tesla Cybertruck’s faulty door handles caused woman’s death, lawsuit alleges",
      "description": "The family of 19-year-old Krysta Tsukahara has filed a wrongful death lawsuit against Tesla, alleging its “dangerously defective” Cybertruck door handle design trapped her inside a burning vehicle, as first reported by The New York Times. The lawsuit, filed in a California court on Thursday, claims Tesla continued to sell its vehicles despite “repeated and direct notice” that its electronic door handles posed a serious risk of entrapment.In November 2024, the driver of a Cybertruck carrying three passengers hit a tree in Piedmont, California. The crash killed the driver, 19-year-old...",
      "url": "https://www.theverge.com/news/791327/tesla-cybertruck-faulty-door-handles-wrongful-death-lawsuit",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T15:01:23+00:00"
    },
    {
      "author": "Matt Tate",
      "title": "Indonesia suspends TikTok’s operating licence for allegedly withholding data",
      "description": "Indonesia has suspended TikTok’s operational registration status in the country, alleging that the social media platform did not fully co-operate with a request to share its data during nationwide protests in August. In a statement, Alexander Sabar, an official from Indonesia’s digital and communications ministry, said TikTok had violated national laws by only providing partial data while the protests were ongoing between August 23 and 30.Sabar said TikTok was given until September 23 to hand over its data related to traffic, streaming and monetization, after it emerged that some accounts...",
      "url": "https://www.engadget.com/big-tech/indonesia-suspends-tiktoks-operating-licence-for-allegedly-withholding-data-145134189.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-02%2F2f6fe710-4ddf-11ea-b3ff-ca9d067be64b&resize=1400%2C933&client=19f2b5e49a271b2bde77&signature=fe62745fadadde4eceb5200df13a797b4aecd055",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T14:51:35+00:00"
    },
    {
      "author": "Andre Revilla",
      "title": "A four-pack of Apple AirTags is 25 percent off ahead of Prime Day",
      "description": "Amazon's fall edition of Prime Day is right around the corner, but you can already get some great deals on popular products like the Apple AirTag. Right now, a four-pack of Apple AirTags is $75, 25 percent off the regular price. If you're an Apple user, then the AirTag is the best Bluetooth tracker on the market for you. You can put these little discs in your wallet, in a backpack or in your luggage while you're traveling. Your AirTag's location will show up in your Find My app, powered by the vast network of iPhones, iPads and other compatible devices that receive the AirTag's Bluetooth signal...",
      "url": "https://www.engadget.com/deals/a-four-pack-of-apple-airtags-is-25-percent-off-ahead-of-prime-day-143112321.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-08%2Ff56c82e0-81ad-11f0-8fef-1c0422a1bc17&resize=1400%2C908&client=19f2b5e49a271b2bde77&signature=d6852176c1b86728fab0319936a36d14cb83d0f3",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T14:31:12+00:00"
    },
    {
      "author": null,
      "title": "Apple pulls US immigration official tracking apps",
      "description": "The creator of ICEBlock accuses the tech giant of \"capitulating to an authoritarian regime\" by removing his app.",
      "url": "https://www.bbc.com/news/articles/c708y1egzlko?at_medium=RSS&at_campaign=rss",
      "source": "BBC News - Technology",
      "image": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5032/live/06d111e0-a053-11f0-b687-23a5afa8b42e.jpg",
      "category": "technology",
      "language": "en",
      "country": "gb",
      "published_at": "2025-10-03T14:12:47+00:00"
    },
    {
      "author": null,
      "title": "Tech Giant Bows to MAGA Demands on ICE Goon Tracker Apps",
      "description": "Comments",
      "url": "https://www.thedailybeast.com/apple-bows-to-maga-demands-and-removes-ice-tracking-apps/",
      "source": "Hacker News",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T14:05:31+00:00"
    },
    {
      "author": "Valentina Palladino",
      "title": "The best Amazon Prime Day deals include early tech discounts on Apple, Samsung, Anker, Shark and others",
      "description": "October Prime Day will be here soon on October 7 and 8, but as to be expected, you can already find some decent sales available now. Amazon always has lead-up sales in the days and weeks before Prime Day, and it’s wise to shop early if you’re on the hunt for something specific and you see that item at a good discount.Prime Day deals are typically reserved for subscribers, but there are always a few that anyone can shop. We expect this year to be no exception, and we’re already starting to see that trend in these early Prime Day deals. These are the best Prime Day deals you can get right...",
      "url": "https://www.engadget.com/deals/the-best-amazon-prime-day-deals-include-early-tech-discounts-on-apple-samsung-anker-shark-and-others-050801003.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-06%2F70db59a0-4acd-11f0-bd1b-a6a20e1c0e4f&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=e76d2c7a9269e2ef4335c701c4bb3a217e857a5a",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T14:01:27+00:00"
    },
    {
      "author": "Victoria Song",
      "title": "With a Friend like this, who needs enemies?",
      "description": "Makin’ my way downtown, walkin’ fast, faces pass, and hopin’ no one punches me for wearing this. This is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest phones, smartwatches, apps, and other gizmos that swear they're going to change your life. Optimizer arrives in our subscribers' inboxes at 10AM ET. Opt in for Optimizer here.The New York City subway is famous for its ads. Ask any New Yorker of a certain age, and they'll tell you that Law & Order's Jerry Orbach \"gave his heart and soul to acting, and the gift...",
      "url": "https://www.theverge.com/column/791010/optimizer-friend-ai-companion-wearables",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T14:00:00+00:00"
    },
    {
      "author": "Lawrence Bonk",
      "title": "This Roomba robot vacuum is 40 percent off for Prime Day",
      "description": "The iRobot Roomba 104 robot vacuum is on sale for $150 just ahead of October's Prime Day. That's a nice little discount of 40 percent, which represents a savings of $100. This is a newer version of the unit that topped our list of the best budget robot vacuums. It's an entry-level robovac that gets the job done. The cleaning motor is fairly powerful and it ships with a multi-surface brush and an edge-sweeping brush. The vacuum uses LiDAR to map a home and to help it avoid obstacles when cleaning. It's also been equipped with specialized sensors to prevent falling down stairs. Steps are the...",
      "url": "https://www.engadget.com/deals/this-roomba-robot-vacuum-is-40-percent-off-for-prime-day-164953707.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2F668c2350-9d50-11f0-9fea-4b9769d479d0&resize=1400%2C911&client=19f2b5e49a271b2bde77&signature=e6b309360c061035fc321c6f8d1fd4c1f58be40c",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T13:50:35+00:00"
    },
    {
      "author": "David Pierce",
      "title": "The real price of a free TV",
      "description": "Back in 2023, Telly CEO Ilya Pozin came on The Vergecast and made a surprisingly compelling case for the existence of a TV that doesn't cost you a dime - but shows ads all the time. It's a reasonable business model, and a pretty good deal for consumers! But as The Verge's Emma Roth discovered, the reality of the situation is a bit different.On this episode of The Vergecast, we talk a lot about Telly. But first, The Verge's Jen Pattison-Tuohy joins David to go through all the smart home and smart speaker news of the week, from Amazon's many new Echos and Kindles to the handsome new Google Home...",
      "url": "https://www.theverge.com/podcast/791253/telly-free-tv-ads-amazon-echo-vergecast",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T13:33:13+00:00"
    },
    {
      "author": "Lorenzo Franceschi-Bicchierai, Zack Whittaker",
      "title": "Hacking group claims theft of 1 billion records from Salesforce customer databases",
      "description": "The hacking group claims to have stolen about a billion records from companies, including FedEx, Qantas, and TransUnion, who store their customer and company data in Salesforce.",
      "url": "https://techcrunch.com/2025/10/03/hacking-group-claims-theft-of-1-billion-records-from-salesforce-customer-databases/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T13:17:43+00:00"
    },
    {
      "author": "Kris Holt",
      "title": "The latest Anker Prime charging devices are already 20 percent off",
      "description": "Anker has a bunch of new Prime charging devices available and some of them are already getting solid discounts. The lineup includes a laptop-compatible Prime Power Bank (26,250mAh, 300W). The device's Amazon page currently features a clippable coupon that will take $46 off the price, reducing it by 20 percent. That means you'll be able to snap this powerbank up for $184. This portable charger delivers a whopping 300W of total output between its two USB-C ports and single USB-A port. Anker says that, thanks to its 140W output (and if you're using a 5A cable), you can top up the battery of an M4...",
      "url": "https://www.engadget.com/deals/the-latest-anker-prime-charging-devices-are-already-20-percent-off-152040882.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2F682d7840-9d45-11f0-bd7f-a52081075e15&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=8222bf0b821811691055a8ca117398c3448fc03a",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T13:15:35+00:00"
    },
    {
      "author": "Jennifer Pattison Tuohy",
      "title": "I tried Amazon and Google’s new smart home gadgets, ask me anything!",
      "description": "The Verge’s senior reviewer, Jen Tuohy, is taking your questions about Amazon and Google’s new devices. Hi! I'm Jennifer Pattison Tuohy (aka Jen), The Verge's smart home reviewer. I just spent the last week in New York City getting hands-on with the new smart displays, smart speakers, smart voice assistants, and smart security cameras launched by Amazon and Google.I'm hosting a subscriber-only AMA on the site today, Friday, October 3rd. Just ask your questions in the comments on this post, and my editor, Nathan Edwards, and I will join you here at 1 PM to answer as many as we can. View this...",
      "url": "https://www.theverge.com/tech/790817/amazon-alexa-show-google-gemini-nest-hands-on-ama",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T13:03:07+00:00"
    },
    {
      "author": "Sean O'Kane",
      "title": "New deep tech fund Wave Function Ventures raises $15 million",
      "description": "Former SpaceX Falcon 9 engineer Jamie Gull, who started the fund, has already made nine investments.",
      "url": "https://techcrunch.com/2025/10/03/new-deep-tech-fund-wave-function-ventures-raises-15-million/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T13:00:11+00:00"
    },
    {
      "author": "Ram Iyer",
      "title": "Apple removes ICEBlock and similar tracking apps from the App Store",
      "description": "Apple has removed ICEBlock and other apps from its App Store that allow users to anonymously report sightings of U.S. Immigration and Customs Enforcement (ICE) agents, following pressure from the Trump administration.",
      "url": "https://techcrunch.com/2025/10/03/apple-removes-iceblock-and-similar-tracking-apps-from-the-app-store/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T12:53:28+00:00"
    },
    {
      "author": "Valentina Palladino,Amy Skorheim,Jeff Dunn",
      "title": "Today's best iPad deals include $50 off the 256GB iPad A16",
      "description": "We generally consider Apple’s iPads to be the best tablets for most people, but most of them don’t come cheap. To help make sure you get the most value possible, we’re keeping a constant eye on sale prices and rounding up the best iPad deals we can find each week.Sadly, this week’s selection is very light: The $150 drops we saw for the iPad Air last week are gone, the iPad mini isn’t discounted and the current iPad Pro is a no-go with a new model expected to launch very soon. We'd expect more discounts during Amazon's October Prime Day sale next week. That said, if you’ve been...",
      "url": "https://www.engadget.com/deals/todays-best-ipad-deals-include-50-off-the-256gb-ipad-a16-150020379.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2Fee5534d0-9af2-11f0-be5f-8585e5963e03&resize=1400%2C933&client=19f2b5e49a271b2bde77&signature=dd8eab6b48463bb22121af63d3cc064825333d30",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T12:29:58+00:00"
    },
    {
      "author": "Kris Holt",
      "title": "October Prime Day deals include up to $400 off Shark robot vacuums",
      "description": "With fall Prime Day around the corner, we're already starting to see solid deals on tech we love. Case in point: Shark robot vacuums. Shark makes some of our favorite robovacs and a few of them are already discounted for Prime members ahead of the sale. The Shark AV2501S AI Ultra robot vacuum is one of them, with a whopping 58-percent discount that brings it down to $230. This discount marks a record low for this model. Shark offers several variations of its AI Ultra robot vacuums. There are small variations between them, and a different model is our pick for the best robot vacuum for most...",
      "url": "https://www.engadget.com/deals/october-prime-day-deals-include-up-to-400-off-shark-robot-vacuums-171836811.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-09%2Fdd960e50-9a2d-11f0-bfdb-ccf1a9eea48f&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=374bd5f086d850dc18cfde692bb5f8355e28154f",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T12:11:28+00:00"
    },
    {
      "author": null,
      "title": "QuestDB (YC S20) Is Hiring a Core Database Engineer – C++ and Rust",
      "description": "Comments",
      "url": "https://questdb.com/careers/core-database-engineer/",
      "source": "Hacker News",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T12:00:43+00:00"
    },
    {
      "author": "Jess Weatherbed",
      "title": "Japan’s most popular beer is running low after cyberattack",
      "description": "A system failure has slowed production of Asahi Super Dry in Japan, with no available ETA for recovery. Japan is facing a potential shortage of Asahi beer after a cyberattack against the beverage maker forced its systems offline. Asahi Group issued a statement on Monday announcing that order, shipment, and call center operations at the company had been suspended due to the systems outage, and that the disruption was limited to Japan.The company has now started to manually process orders, according to an updated notice published today, but system-based orders and wide-scale shipments remain...",
      "url": "https://www.theverge.com/news/791192/asahi-beer-cyberattack-systems-outage",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T11:28:32+00:00"
    },
    {
      "author": "Kevin Roose, Casey Newton, Rachel Cohn, Whitney Jones, Jen Poyant, Alyssa Moxley, Dan Powell, Marion Lozano and Rowan Niemisto",
      "title": "Sora and the Infinite Slop Feeds + ChatGPT Goes to Therapy + Hot Mess Express",
      "description": "“I do not like the idea of pointing these giant A.I. supercomputers at people’s dopamine receptors and just feeding them an endless diet of hyper-personalized stimulating videos.”",
      "url": "https://www.nytimes.com/2025/10/03/podcasts/sora-and-the-infinite-slop-feeds-chatgpt-goes-to-therapy-hot-mess-express.html",
      "source": "The New York Times",
      "image": "https://static01.nyt.com/images/2025/10/03/podcasts/03hardfork-slop-feeds/03hardfork-slop-feeds-mediumSquareAt3X-v4.png",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T11:00:06+00:00"
    },
    {
      "author": "Jeff Dunn",
      "title": "The best microSD cards for the Nintendo Switch 2",
      "description": "The Nintendo Switch 2 is here, and that means millions of people will eventually have to buy a new microSD card. While the console comes with 256GB of storage on its own, its improved performance means that some games will chew up a ton of space. Cyberpunk 2077&nbsp;is a 60GB download, for example, while Split Fiction&nbsp;checks in at 69GB. Other titles aren’t nearly as big (particularly those made by Nintendo itself), but it’s not hard to see how you could end up deleting and redownloading games within a couple months.Whenever you do want to add room, you’ll need a microSD Express card...",
      "url": "https://www.engadget.com/gaming/nintendo/best-microsd-cards-for-nintendo-switch-2-160052947.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-08%2Fc9ead4f0-7217-11f0-b36b-85ce05100f66&resize=1400%2C787&client=19f2b5e49a271b2bde77&signature=9601a6098ebed7034876477898ee1ab1a01aaa4d",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T09:01:27+00:00"
    },
    {
      "author": "Andre Revilla",
      "title": "You can get 3 months of Audible for just $3 right now",
      "description": "Audiobook fans can get three months of Audible for $3 for a limited time ahead of the fall edition of Amazon Prime Day. Users will be charged $0.99 per month for the first three months, after which it will auto-renew at $14.95 per month.Audible features thousands of titles in its catalog, including podcasts and Audible Originals. Subscribers will also get to choose one audiobook each month to keep in their collection for free, including best-sellers or new releases. Amazon Prime members will receive two credits the first month of their trial.Amazon has been bringing Prime Day back in the fall...",
      "url": "https://www.engadget.com/deals/you-can-get-3-months-of-audible-for-just-3-right-now-090052477.html?src=rss",
      "source": "Engadget",
      "image": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2023-11%2Fb0d23590-7a51-11ee-bf3b-6908f61b2e4b&resize=1400%2C770&client=19f2b5e49a271b2bde77&signature=e1c89dc6a5ba03cc479bcd00610833910db2da45",
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T09:00:52+00:00"
    },
    {
      "author": "Connie Loizos",
      "title": "After nine years of grinding, Replit finally found its market. Can it keep it?",
      "description": "While AI coding startups like Cursor raise brow-raising rounds on barely three years of existence, Replit's path to a $3 billion valuation has been anything but swift.",
      "url": "https://techcrunch.com/2025/10/02/after-nine-years-of-grinding-replit-finally-found-its-market-can-it-keep-it/",
      "source": "TechCrunch",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T04:58:16+00:00"
    },
    {
      "author": "Richard Lawler",
      "title": "Apple pulls ICEBlock from the App Store",
      "description": "Apple has removed the “Waze but for ICE sightings” app ICEBlock from its App Store, as reported previously by Business Insider. A post from its developer relayed Apple’s App Review message about the ban, saying, “We just received a message from Apple&#8217;s App Review that #ICEBlock has been removed from the App Store due to ‘objectionable content.’ The only thing we can imagine is this is due to pressure from the Trump Admin. We have responded and we&#8217;ll fight this!”The ICEBlock app rose to the top of the App Store’s charts this summer after being targeted by Trump...",
      "url": "https://www.theverge.com/news/791170/iceblock-app-store-removed-by-apple",
      "source": "The Verge",
      "image": null,
      "category": "technology",
      "language": "en",
      "country": "us",
      "published_at": "2025-10-03T01:57:40+00:00"
    }
  ]
}